       IDENTIFICATION DIVISION.
       PROGRAM-ID. CAPIVA.
       AUTHOR. GUIFFREY ALVARO.
       DATE-WRITTEN. ENE'92.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. PC-XT-AT.
       OBJECT-COMPUTER. PC-XT-AT.
      * SPECIAL-NAMES.
      *       DECIMAL-POINT IS COMMA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       COPY "CUENTA.SEL".
       COPY "EMPRE.SEL".
       COPY "IVA.SEL".
       COPY "ALICUO.SEL".
       COPY "IMPU.SEL".
       COPY "ACTI.SEL".
       COPY "RES127.SEL".
       COPY "INSDIR.SEL".
       COPY "PANTA.SEL".
       DATA DIVISION.
       FILE SECTION.
       COPY "CUENTABM.REG".
       COPY "EMPREBM.REG".
       COPY "ALICUO.REG".
       COPY "IVA.REG".
       COPY "IMPU.REG".
       COPY "RES127.REG".
       COPY "INSDIR.REG".
       COPY "ACTI.REG".
       COPY "PANTA.REG".
       WORKING-STORAGE SECTION.
       01 CAPTURA.
	  02 POR-COM           PIC 99V999 VALUE 0.
	  02 IVA-CAP           PIC 9 VALUE 0.
	  02 FEC-CAP.
	     03 DIA-CAP        PIC 9(2) VALUE 0.
	     03 MES-CAP        PIC 9(2) VALUE 0.
	     03 ANO-CAP        PIC 9(2) VALUE 0.
	  02 RUBRO-CAP         PIC 9(7) VALUE 0.
	  02 CUE-CAP           PIC 9(6) VALUE 0.
	  02 INS-CAP           PIC X VALUE SPACES.
	  02 DESCR-CAP         PIC X(30) VALUE SPACES.
	  02 CUIT-CAP          PIC X(15) VALUE SPACES.
	  02 TIP-COM-CAP       PIC 9 VALUE 0.
	  02 SUB-T-C-CAP       PIC X VALUE SPACES.
	  02 SUC-C-CAP         PIC 9(4) VALUE 0.
	  02 COM-CAP           PIC 9(8) VALUE 0.
          02 ANO1              PIC 9999 VALUE 0.
	  02 NETO-CAP          PIC S9(10)V99 VALUE 0.
	  02 NO-GRA-CAP        PIC S9(10)V99 VALUE 0.
	  02 EXE-CAP           PIC S9(10)V99 VALUE 0.
	  02 DED-CAP           PIC S9(10)V99 VALUE 0.
	  02 RET-CAP           PIC S9(10)V99 VALUE 0.
	  02 IMP-1-CAP         PIC S9(10)V99 VALUE 0.          
	  02 IMP-2-CAP         PIC S9(10)V99 VALUE 0.
	  02 IMP-A1-CAP        PIC S9(10)V9999 VALUE 0.
	  02 IMP-A2-CAP        PIC S9(10)V9999 VALUE 0.
	  02 CRE-DEB-CAP       PIC S9(10)V99 VALUE 0.
	  02 PER-CAP           PIC S9(10)V99 VALUE 0.
	  02 TOT-CAP           PIC S9(10)V99 VALUE 0.
	  02 TOT-CAP1          PIC S9(10)V99 VALUE 0.
	  02 TOT-INT1          PIC S9(10)V99 VALUE 0.
	  02 ALI-CAP           PIC 9(3) VALUE 0.
	  02 FEC-VAL-CAP.
	     03 DIA-VAL-CAP    PIC 9(2) VALUE 0.
	     03 MES-VAL-CAP    PIC 9(2) VALUE 0.
	     03 ANO-VAL-CAP    PIC 9(2) VALUE 0.
       01 EDICION.
	  02 IVA-EDI           PIC 9.
	  02 FEC-EDI.
	     03 DIA-EDI        PIC 99/.
	     03 MES-EDI        PIC 99/.
	     03 ANO-EDI        PIC 99.
	  02 RUBRO-EDI         PIC ZZZZZZ9.
	  02 CUE-EDI           PIC ZZZZZ9.
	  02 INS-EDI           PIC X.
	  02 D-INS-EDI         PIC X(10).
	  02 D-IVA-EDI         PIC X(10).
	  02 DESCR-EDI         PIC X(30).
	  02 CUIT-EDI          PIC X(15).
	  02 TIP-COM-EDI       PIC 9.
	  02 D-TIP-COM-EDI     PIC XXXX.
	  02 SUB-T-C-EDI       PIC X.
	  02 SUC-C-EDI         PIC 9999.
	  02 COM-EDI           PIC 9(8).
	  02 NETO-EDI          PIC --,---,---,--9.99.
	  02 NO-GRA-EDI        PIC --,---,---,--9.99.
	  02 EXE-EDI           PIC --,---,---,--9.99.
	  02 DED-EDI           PIC --,---,---,--9.99.
	  02 RET-EDI           PIC --,---,---,--9.99.
	  02 IMP-1-EDI         PIC --,---,---,--9.99.
	  02 IMP-2-EDI         PIC --,---,---,--9.99.
	  02 CRE-DEB-EDI       PIC --,---,---,--9.99.
	  02 D-CRE-DEB-EDI     PIC X(10).
	  02 PER-EDI           PIC --,---,---,--9.99.
	  02 TOT-EDI           PIC --,---,---,--9.99.
	  02 ALI-EDI           PIC ZZ9.
	  02 FEC-VAL-EDI.
	     03 DIA-VAL-EDI    PIC 99/.
	     03 MES-VAL-EDI    PIC 99/.
	     03 ANO-VAL-EDI    PIC 99.
	  02 IVA-1-EDI         PIC Z9.
	  02 IVA-2-EDI         PIC Z9.
	  02 IVA-3-EDI         PIC Z9.
       01 AUXILIARES.
	  02 TIP-IVA-EMP       PIC X VALUE SPACES.
	  02 COD-OPE           PIC X VALUE SPACES.
	  02 LISTO-N-D         PIC 999999 VALUE 0.
	  02 LISTO-N-H         PIC 999999 VALUE 0.          
	  02 LISTO-Z           PIC 99.
	  02 LISTO-A-H         PIC X(30).
	  02 CONT-L            PIC 9(6) VALUE 0.
	  02 ZONA-L            PIC 99 VALUE 0.
	  02 RUBRO-L           PIC 9(7) VALUE 0.
	  02 CUENTA-H          PIC 9(6) VALUE 0.
	  02 SUB-CUENTA-H      PIC 9(4) VALUE 0.
	  02 NOMBRE-H          PIC X(30).
	  02 IVA-CON           PIC 9(6) VALUE 0.
	  02 IVA-INT           PIC 9 VALUE 0.
	  02 FEC-INT.
	     03 ANO-INT        PIC 99 VALUE 0.
	     03 MES-INT        PIC 99 VALUE 0.
	     03 DIA-INT        PIC 99 VALUE 0.
	  02 RUBRO-INT         PIC 9(7) VALUE 0.
	  02 CUE-INT           PIC 9(6) VALUE 0.
	  02 INS-INT           PIC X VALUE SPACES.
	  02 D-INS-INT         PIC X(10) VALUE SPACES.
	  02 DESCR-INT         PIC X(30) VALUE SPACES.
	  02 CUIT-INT          PIC X(15) VALUE SPACES.
	  02 TIP-COM-INT       PIC 9 VALUE 0.
	  02 D-TIP-COM-INT     PIC XXXX VALUE SPACES.
	  02 SUB-T-C-INT       PIC X VALUE SPACES.
	  02 SUC-C-INT         PIC 9999 VALUE 0.
	  02 COM-INT           PIC 9(8) VALUE 0.
	  02 NETO-INT          PIC S9(10)V99 VALUE 0.
	  02 NO-GRA-INT        PIC S9(10)V99 VALUE 0.
	  02 EXE-INT           PIC S9(10)V99 VALUE 0.
	  02 DED-INT           PIC S9(10)V99 VALUE 0.
	  02 RET-INT           PIC S9(10)V99 VALUE 0.
	  02 IMP-1-INT         PIC S9(10)V99 VALUE 0.
	  02 IMP-2-INT         PIC S9(10)V99 VALUE 0.
	  02 CRE-DEB-INT       PIC S9(10)V99 VALUE 0.
	  02 PER-INT           PIC S9(10)V99 VALUE 0.
	  02 ALI-INT           PIC 999 VALUE 0.
	  02 FEC-VAL-INT.
	     03 DIA-VAL-INT    PIC 99 VALUE 0.
	     03 MES-VAL-INT    PIC 99 VALUE 0.
	     03 ANO-VAL-INT    PIC 99 VALUE 0.
	  02 IVA-1-INT         PIC 99V99 VALUE 0.
	  02 IVA-2-INT         PIC 99V99 VALUE 0.
	  02 IVA-3-INT         PIC 99V99 VALUE 0.
	  02 IMP-CLA           PIC X.
	  02 IMP-PRO           PIC X.
	  02 IMP-MUN           PIC X.
	  02 INT-IMP           PIC 9 VALUE 0.
	  02 INT-ACT           PIC 999 VALUE 0.
	  02 INT-NET           PIC S9(12)V99 VALUE 0.
	  02 IMP-SUM           PIC S9(12)V99 VALUE 0.
	  02 EDI-NET           PIC -----,--9.99.
	  02 PRO-TOT           PIC S9(12)V99 VALUE 0.
	  02 MUN-TOT           PIC S9(12)V99 VALUE 0.
	  02 GAS-TOT           PIC S9(12)V99 VALUE 0.
	  02 COD-LEO           PIC XX VALUE SPACES.
	  02 VEC-PER OCCURS 20.             
	  05 ALI-PER      PIC 99V999 VALUE 0.
	  02 ZZ                PIC 99 VALUE 0.
	  02 BASE-CAP         PIC S9(8)V99 VALUE 0.
	  02 RES-CAP          PIC S9(8)V99 VALUE 0.
	  02 BASE-EDI         PIC ---,---,--9.99.
	  02 RES-EDI          PIC ---,---,--9.99.
	  02 D-IBRU           PIC X(15) VALUE SPACES.
       COPY "ABREV.WOR".
       COPY "CLAVES.WOR".
       COPY "DPVARIOS.WOR".
       SCREEN SECTION.
	 01 P-001.
	   02 L1 LINE 20 COL 50 VALUE "/----------------------\".
	   02 L2 LINE 21 COL 50 VALUE "| -         -   FISCAL |".
	   02 L3 LINE 22 COL 50 VALUE "| $                    |".
	   02 L4 LINE 23 COL 50 VALUE "\----------------------/".
	 01 P-003.
	   02 L1-3 LINE 15 COL 50 VALUE "/----------------------\".
	   02 L2-3 LINE 16 COL 50 VALUE "|  INGRESE PORCENTAJE  |".
	   02 L3-3 LINE 17 COL 50 VALUE "| de FACTURA:       %  |".
	   02 L4-3 LINE 18 COL 50 VALUE "\----------------------/".
	 01 P-004.
	   02 L1-4 LINE 15 COL 50 VALUE "/-RES.127/93 - D.G.R.--\".
	   02 L2-4 LINE 16 COL 50 VALUE "| BASE:                |".
	   02 L3-4 LINE 17 COL 50 VALUE "| PERC:                |".
	   02 L4-4 LINE 18 COL 50 VALUE "\----------------------/".           
       PROCEDURE DIVISION.
       DECLARATIVES.
       COPY "CUENTA.ERR".
       COPY "ALICUO.ERR".
       COPY "EMPRE.ERR".
       COPY "IVA.ERR".
       COPY "ACTI.ERR".
       COPY "RES127.ERR".
       COPY "INSDIR.ERR".
       COPY "IMPU.ERR".
       END DECLARATIVES.
       PROGRAMA SECTION.
       ABRO.
	   PERFORM CONF-CAMPOS.
	   MOVE 0 TO CLAVE-1-CAP.
       INI-MOD.
	   MOVE "GIMODA" TO NOM-PAN.
	   OPEN INPUT PANTA.
	   READ PANTA.
	   CLOSE PANTA.
	   MOVE 0 TO SW2 COD-CLAVE. 
       PANTA-INI. 
	   ADD 1 TO SW2.
	   IF SW2 = 25 GO TO SIGA-CLAVE.
	   DISPLAY LIN-PAN(SW2) LINE SW2 POSITION 1.
	   GO TO PANTA-INI.
       SIGA-CLAVE.
	   IF CLAVE-1-CAP NOT = 0 GO TO SIGA-INI.
	   PERFORM CLAVE-SYS.           
	   PERFORM BORRA-CLAVE.
       SIGA-INI.
	   PERFORM TIT-PAN.
	   PERFORM TITU-PAN.
	   PERFORM FECHA-PAN.
	   PERFORM OPC-MODA.
	   PERFORM MEN-MODA-A.
       CARGO-MOD.
	   MOVE 28 TO SW3.
	   PERFORM BORRA.
	   ACCEPT COD1 LINE TAB-LIN(SW3) POSITION TAB-COL(SW3)
		       SIZE TAB-SIZ(SW3) 
		       ON EXCEPTION EXCEP GO TO TAREAS.
	   GO TO CARGO-MOD.
       TAREAS.
	   IF ESCAP EXIT PROGRAM
		    STOP RUN.
	   IF F01 GO TO TAREA1.
	   IF F03 GO TO CONS-NUM.
	   GO TO CARGO-MOD.
       TAREA1.
	   OPEN INPUT  CUENTAS EMPRESAS IVA ALICUO.
	   MOVE " ALTA DE DATOS " TO D20-CAP.
	   MOVE "A" TO COD-OPE.
	   PERFORM MEN-MODA-S.
	   PERFORM MODA-PAN.
	   PERFORM BORRA-PANTA.
	   DISPLAY SPACES LINE 8 POSITION 37 SIZE 25.
	   PERFORM PANTA-1 THRU PANTA-11.
	   PERFORM CARGA-EMP THRU CARGA-EMP-F.
	   PERFORM CHEQUEA-CLAVE1.
	   IF COD-CLAVE = 9 PERFORM CIERRE-A GO TO INI-MOD.
	   MOVE IVA-C-EMP TO IVA-CON.
	   MOVE "R" TO TIP-IVA-EMP.
	   IF IVA-EMP = "RESP. INSC./RET" MOVE "R" TO TIP-IVA-EMP.
	   IF IVA-EMP = "RESP. INSC./EXE" MOVE "R" TO TIP-IVA-EMP.
	   IF IVA-EMP = "RESP. INSCRIPTO" MOVE "R" TO TIP-IVA-EMP.
	   IF IVA-EMP = "RESP. NO INSCR." MOVE "N" TO TIP-IVA-EMP.
	   IF IVA-EMP = "EXENTO" MOVE "E" TO TIP-IVA-EMP.
	   IF IVA-EMP = "NO RESPONSABLE" MOVE "E" TO TIP-IVA-EMP.
	   DISPLAY TIP-IVA-EMP LINE 8 POSITION 37 SIZE 1.
	   DISPLAY IVA-EMP LINE 8 POSITION 40 SIZE 20.
	   OPEN INPUT ACTI.
	   MOVE 2 TO IMP-ACT.
	   MOVE 981 TO ACT-ACT.
	   PERFORM LEO-ACT.
	   MOVE POR-ACT TO ALI-PER(1).
	   MOVE 982 TO ACT-ACT.
	   PERFORM LEO-ACT.
	   MOVE POR-ACT TO ALI-PER(2).
	   MOVE 983 TO ACT-ACT.
	   PERFORM LEO-ACT.
	   MOVE POR-ACT TO ALI-PER(3).
	   MOVE 984 TO ACT-ACT.
	   PERFORM LEO-ACT.           
	   MOVE POR-ACT TO ALI-PER(4).
	   MOVE 991 TO ACT-ACT.
	   PERFORM LEO-ACT.
	   MOVE POR-ACT TO ALI-PER(11).
	   MOVE 992 TO ACT-ACT.
	   PERFORM LEO-ACT.
	   MOVE POR-ACT TO ALI-PER(12).
	   MOVE 993 TO ACT-ACT.
	   PERFORM LEO-ACT.
	   MOVE POR-ACT TO ALI-PER(13).
	   MOVE 994 TO ACT-ACT.
	   PERFORM LEO-ACT.
	   MOVE POR-ACT TO ALI-PER(14).
	   MOVE 995 TO ACT-ACT.
	   PERFORM LEO-ACT.
	   MOVE POR-ACT TO ALI-PER(15).
	   MOVE 996 TO ACT-ACT.
	   PERFORM LEO-ACT.
	   MOVE POR-ACT TO ALI-PER(16).
	   CLOSE ACTI.
       TAREA1-1.
	   IF COD-OPE NOT = "A" GO TO CONS-NUM.
	   PERFORM BORRA-PANTA-C THRU BORRA-PANTA-C11.
	   PERFORM PANTA-11.
	   PERFORM CARGA-LIB THRU CARGA-ALI.
       TAREA1-2.
	   PERFORM BORRA-PANTA-C1 THRU BORRA-PANTA-C11.
	   PERFORM PANTA-11.
	   PERFORM CARGA-RUB.
	   IF RUBRO-CAP = 0 MOVE 0 TO CUE-CAP
		   GO TO TAREA1-4.
	   PERFORM CARGA-CUE.
	   IF CUE-CAP = 0 GO TO TAREA1-4.
	   MOVE NUM-EMP TO EMP-CTA.
	   MOVE SUC-EMP TO SUC-CTA.
	   MOVE RUBRO-CAP TO RUBRO-CTA.
	   MOVE CUE-CAP TO CUENTA.
	   MOVE 0 TO SUB-CUENTA.
	   READ CUENTAS INVALID KEY GO TO CUENTA1-4.
	   MOVE NOMBRE-C TO DESCR-CAP DESCR-IVA.
	   MOVE INSCRIPTO TO INS-CAP INS-IVA.
	   MOVE IGAN TO CUIT-CAP CUIT-IVA.
	   PERFORM DESP-DES.
	   PERFORM DESP-INS.
	   PERFORM DESP-CUIT.
	   GO TO ALTA.
       TAREA1-4.
	   MOVE "<F1> NO BUSCA  " TO MEN-1.
	   MOVE "<F3> BUSCA ALF." TO MEN-2.
	   MOVE SPACES TO MEN-3.
	   PERFORM MENS-PAN.
	   MOVE 28 TO SW3.
	   PERFORM BORRA.
	   ACCEPT COD1 LINE TAB-LIN(SW3) POSITION TAB-COL(SW3)
		       SIZE TAB-SIZ(SW3)                       
		       ON EXCEPTION EXCEP MOVE SW3 TO SW3.
	   IF F01 GO TO TAREA1-41.
	   IF F03 GO TO VEO-CUENTA.
       TAREA1-41.
	   PERFORM MEN-ANTE-DES.
	   PERFORM CARGA-DES.
	   PERFORM CARGA-INS.
	   IF INS-CAP = "C" OR INS-CAP = "c" 
		  MOVE SPACES TO CUIT-IVA CUIT-CAP
		  MOVE 0 TO C-ING-BRUTOS
		  GO TO ALTA.
	   PERFORM CARGA-CUIT.
	   GO TO ALTA.
       VEO-CUENTA.
	   PERFORM MEN-ANTE-DES.
	   PERFORM CARGA-DES.
	   MOVE "AD" TO COD-LEO.
	   START CUENTAS KEY IS NOT < NOMBRE-C
			INVALID KEY GO TO TAREA1-2.
       VEO-C1.
	   IF COD-LEO = "AD"
	       READ CUENTAS NEXT AT END GO TO TAREA1-2.
	   IF COD-LEO = "AT"
	       READ CUENTAS PREVIOUS AT END GO TO TAREA1-2.
	   IF EMP-IVA NOT = EMP-CTA GO TO VEO-C1.
	   IF SUC-EMP NOT = SUC-CTA GO TO VEO-C1.
	   MOVE NOMBRE-C TO DESCR-IVA.
	   MOVE IGAN TO CUIT-IVA.
	   MOVE INSCRIPTO TO INS-IVA INS-CAP.
	   MOVE CUENTA TO CUE-IVA.
	   MOVE RUBRO-CTA TO RUBRO-IVA.
	   PERFORM DESP-RUB.
	   PERFORM DESP-CUE.
	   PERFORM DESP-DES.
	   PERFORM DESP-INS.
	   PERFORM DESP-CUIT.
	   PERFORM MEN-ANTE-DES.
	   MOVE 28 TO SW3.
	   PERFORM BORRA.
	   ACCEPT COD1 LINE TAB-LIN(SW3) POSITION TAB-COL(SW3)
		       SIZE TAB-SIZ(SW3) 
		       ON EXCEPTION EXCEP MOVE SW3 TO SW3.
	   IF F02 MOVE "AT" TO COD-LEO GO TO VEO-C1.
	   IF F03 MOVE "AD" TO COD-LEO GO TO VEO-C1.
	   GO TO ALTA.                                            
       CUENTA1-4.
	   PERFORM CARGA-DES.
	   PERFORM PANTA-2.
	   PERFORM BORRA-PANTA-C2.
	   PERFORM CARGA-DOM.
	   PERFORM CARGA-CP.
	   PERFORM CARGA-TEL.
       CUENTA1-41.
	   PERFORM CARGA-IBRU.
	   PERFORM CARGA-C-IBRU.
	   PERFORM BORRA-PANTA-C11.           
	   PERFORM PANTA-11.
	   PERFORM CARGA-INS.
	   IF INS-CAP = "C" OR INS-CAP = "c"
	      IF C-ING-BRUTOS NOT = 0
		  MOVE "-- VERIFIQUE CO" TO MEN-1
		  MOVE "DIGOS DE SITUAC" TO MEN-2
		  MOVE "ION --         " TO MEN-3
		  PERFORM MENS-PAN 100 TIMES
		  PERFORM PANTA-2
		  PERFORM BORRA-PANTA-C2
		  MOVE 38 TO SW3
		  PERFORM BORRA
		  DISPLAY DIRE LINE TAB-LIN(SW3) POSITION TAB-COL(SW3)
			   SIZE TAB-SIZ(SW3)
		  MOVE 39 TO SW3
		  PERFORM BORRA
		  DISPLAY COD-LOCA LINE TAB-LIN(SW3) POSITION 
			  TAB-COL(SW3) SIZE TAB-SIZ(SW3)
		  MOVE 40 TO SW3
		  PERFORM BORRA
		  DISPLAY TEL LINE TAB-LIN(SW3) POSITION TAB-COL(SW3)
			    SIZE TAB-SIZ(SW3)                 
		  GO TO CUENTA1-41.
	   IF INS-CAP = "C" OR INS-CAP = "c" 
		  MOVE SPACES TO CUIT-IVA CUIT-CAP
		  GO TO GRABA-CUE.
	   PERFORM CARGA-CUIT.
	   GO TO GRABA-CUE.
       GRABA-CUE.
	   MOVE EMP-IVA TO EMP-CTA.
	   MOVE SUC-IVA TO SUC-CTA.
	   MOVE RUBRO-IVA TO RUBRO-CTA.
	   MOVE CUE-IVA TO CUENTA.
	   MOVE 0 TO SUB-CUENTA.
	   MOVE "N" TO ESTADO.
	   MOVE 0 TO CONDICION.
	   MOVE 0 TO ZONA.
	   MOVE 0 TO JNC SALDO SALDO-ANT SALDO-CAN SALDO-TOP.
	   MOVE 0 TO PMOV PPEND.
	   CLOSE CUENTAS.
	   OPEN I-O CUENTAS.
	   WRITE REG-CTAS INVALID KEY REWRITE REG-CTAS.
	   CLOSE CUENTAS.
	   OPEN INPUT CUENTAS.
	   GO TO ALTA.
       ALTA.
	   IF IVA-IVA = 1 
	      IF C-ING-BRUTOS > 4 GO TO NOPUEDE.
	   IF IVA-IVA NOT = 1
	      IF C-ING-BRUTOS < 4 GO TO NOPUEDE.
	   PERFORM CARGA-T-C THRU CARGA-F-V.
	   IF COD-OPE = "M" GO TO MODI1.
	   PERFORM LEO-ALI THRU LEO-ALI-F.
	   PERFORM ACERO.
	   MOVE "N" TO IMP-CLA.           
	   IF IVA-CAP = 1
	       IF ALI-IVA > 99 AND ALI-IVA < 110
		   GO TO IVA-VEN4.
	   IF IVA-CAP = 1 
	       IF INS-CAP = "R" OR INS-CAP = "r"
		  IF ALI-IVA < 901 GO TO IVA-VEN1
		    ELSE GO TO IVA-VEN11.
	   IF IVA-CAP = 1
	       IF INS-CAP = "N" OR INS-CAP = "n"
		  IF ALI-IVA < 901 GO TO IVA-VEN2
		    ELSE GO TO IVA-VEN21.
	   IF IVA-CAP = 1
	       IF ALI-IVA < 901 GO TO IVA-VEN3
		 ELSE GO TO IVA-VEN31.
	   IF IVA-CAP = 2
	       IF INS-CAP = "R" OR INS-CAP = "r"
		  IF ALI-IVA > 900
			  GO TO IVA-COM3.
	   IF IVA-CAP = 2
	       IF TIP-IVA-EMP = "E"
		  GO TO IVA-COM2.
	   IF IVA-CAP = 2
	       IF INS-CAP = "R" OR INS-CAP = "r"
		  GO TO IVA-COM1.
	   IF IVA-CAP = 2
	       IF INS-CAP = "N" OR INS-CAP = "n"
		  GO TO IVA-COM2.
	   IF IVA-CAP = 2
	       IF INS-CAP = "E" OR INS-CAP = "e"
		  GO TO IVA-COM2.
           IF IVA-CAP = 2
               IF INS-CAP = "M" OR INS-CAP = "m"
                  GO TO IVA-COM2.
	   IF IVA-CAP = 2
	       IF COD-OPE = "M" GO TO CONS-NUM1
	       GO TO TAREA1-1.
	   IF IVA-CAP = 3
	       IF TIP-IVA-EMP = "E"
		  GO TO IVA-COM2.
	   IF IVA-CAP = 3
	       IF INS-CAP = "R" OR INS-CAP = "r"
		  IF ALI-IVA > 900 GO TO IVA-COM3
		   ELSE GO TO IVA-COM1.
	   IF IVA-CAP = 3
	       IF INS-CAP = "N" OR INS-CAP = "n"
		  GO TO IVA-COM2.
	   IF IVA-CAP = 3
	       IF INS-CAP = "E" OR INS-CAP = "e"
		  GO TO IVA-COM2.
	   IF COD-OPE = "M" GO TO CONS-NUM1.
	   GO TO TAREA1-1.
       IVA-VEN1.
	   MOVE 0 TO TOT-CAP CRE-DEB-CAP BASE-CAP RES-CAP.
	   IF TIP-IVA-EMP NOT = "R"
	       GO TO IVA-VEN3.
	   PERFORM CARGA-NET.
	   PERFORM CARGA-N-GRA.
	   PERFORM CARGA-EXE.
      *    PERFORM CARGA-DED.           
	   IF IVA-EMP = "RESP. INSC./RET"
	      PERFORM CARGA-RET.
	   COMPUTE IMP-1-INT ROUNDED = NETO-CAP * IVA-1-ALI / 100.
	   PERFORM CARGA-I-1.
	   PERFORM CONTROL-I-1 THRU CONTROL-I-1-F.
      *     IF TIP-COM-IVA = 4 OR TIP-COM-IVA = 5
      *       COMPUTE IMP-2-INT ROUNDED = NETO-CAP * IVA-1-ALI / 100
      *       PERFORM CARGA-I-2
      *       PERFORM CONTROL-I-2 THRU CONTROL-I-2-F.
	   PERFORM DESP-CRE.
      *=-=-=-= EMPRESA QUE COBRA UN MONTO COMO PERCEPCION =-=-=-=-=-=
	   PERFORM CARGA-PER.
	   MOVE PER-CAP TO PER-INT.
	   PERFORM CONTROL-PER THRU CONTROL-PER-F.
      *=-=-=-=-=-=-=-=-=-=-==-=-=-=-=-=-=====-=-=-=-=-=-=-=-=-=-=-=-=-
	   IF SEC-PRO-EMP > 1 AND SEC-PRO-EMP < 5
	      IF C-ING-BRUTOS < 3
		 PERFORM SUMA-BASE
		 PERFORM CALC-RES THRU CALC-RES-F.
	   COMPUTE RET-IVA = RET-IVA + RES-CAP.
	   PERFORM DESP-RET.
	   IF COD-OPE = "M" GO TO MODI1.
	   PERFORM MEN-CONF.
	   MOVE 28 TO SW3.
	   PERFORM CAP-COD1.
	   IF ESCAP PERFORM CIERRE-A GO TO INI-MOD.
	   IF F10 MOVE "S" TO IMP-CLA
		    GO TO GRABA-IVA.
	   IF F01 GO TO GRABA-IVA.
	   MOVE SPACES TO MEN-1 MEN-2 MEN-3.
	   PERFORM MENS-PAN.
	   PERFORM M-NO-GRABA 50 TIMES.
	   MOVE SPACES TO MEN-1 MEN-2 MEN-3.
	   PERFORM MENS-PAN.
	   GO TO TAREA1-1.
       IVA-VEN11.
	   MOVE 0 TO TOT-CAP TOT-CAP1 CRE-DEB-CAP RES-CAP BASE-CAP.
      ***** 8/5/95     IF TIP-IVA-EMP NOT = "R" GO TO IVA-VEN3.
	   PERFORM PANTA-3.
	   PERFORM CARGA-TOT.
	   IF SEC-PRO-EMP > 1 AND SEC-PRO-EMP < 5
	      IF C-ING-BRUTOS < 3
		 DISPLAY P-004
		 PERFORM CARGA-RES.
	   PERFORM PANTA-3.
	   PERFORM CARGA-P-C.
	   COMPUTE IMP-A1-CAP ROUNDED = ( TOT-CAP1 - RES-CAP ) 
			    * POR-COM / 100.
	   COMPUTE NETO-CAP ROUNDED = IMP-A1-CAP * 100 / IVA-1-ALI.
	   COMPUTE IMP-1-CAP ROUNDED = NETO-CAP * IVA-1-ALI / 100.
	   COMPUTE NO-GRA-CAP = TOT-CAP1 - NETO-CAP - IMP-1-CAP
			  - RES-CAP.
	   COMPUTE TOT-CAP = NETO-CAP + IMP-1-CAP + NO-GRA-CAP
			     + RES-CAP.
	   IF TOT-CAP NOT = TOT-CAP1
	      COMPUTE NO-GRA-CAP = NO-GRA-CAP - ( TOT-CAP1 -
		       TOT-CAP ).
	   MOVE 0 TO TOT-CAP.
	   MOVE IMP-1-CAP TO IMP-1-IVA.
	   MOVE NO-GRA-CAP TO NO-GRA-IVA.
	   MOVE NETO-CAP TO NETO-IVA.
	   MOVE RES-CAP TO RET-IVA.
	   PERFORM DESP-I-1.
	   COMPUTE IMP-1-INT ROUNDED = NETO-CAP * IVA-1-ALI / 100.
	   PERFORM CONTROL-I-1 THRU CONTROL-I-1-F.
	   PERFORM DESP-CRE.
	   PERFORM DESP-N-GRA.
	   PERFORM DESP-RET.
	   PERFORM DESP-NET.
      *=-=-=-=- EMPRESA QUE COBRA UN MONTO COMO PERCEPCION =-=-=-=-=-
	   PERFORM CARGA-PER.
	   MOVE PER-CAP TO PER-INT.
	   PERFORM CONTROL-PER THRU CONTROL-PER-F.
      *=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-
	   PERFORM DESP-TOT.
	   IF COD-OPE = "M" GO TO MODI1.
	   PERFORM MEN-CONF.
	   MOVE 28 TO SW3.
	   PERFORM CAP-COD1.
	   IF ESCAP PERFORM CIERRE-A GO TO INI-MOD.
	   IF F10 MOVE "S" TO IMP-CLA
		  GO TO GRABA-IVA.
	   IF F01 GO TO GRABA-IVA.
	   MOVE SPACES TO MEN-1 MEN-2 MEN-3.
	   PERFORM MENS-PAN.
	   PERFORM M-NO-GRABA 50 TIMES.
	   MOVE SPACES TO MEN-1 MEN-2 MEN-3.
	   PERFORM MENS-PAN.
	   PERFORM BORRA-PAN3.
	   GO TO TAREA1-1.
       IVA-VEN2.
	   MOVE 0 TO TOT-CAP CRE-DEB-CAP BASE-CAP RES-CAP.
	   IF TIP-IVA-EMP NOT = "R" GO TO IVA-VEN3.
	   PERFORM CARGA-NET.
	   PERFORM CARGA-N-GRA.
	   PERFORM CARGA-EXE.
      *     PERFORM CARGA-DED.
	   IF IVA-EMP = "RESP. INSC./RET" 
	       PERFORM CARGA-RET.
	   COMPUTE IMP-1-INT ROUNDED = NETO-CAP * IVA-1-ALI / 100.
	   PERFORM CARGA-I-1.
	   PERFORM CONTROL-I-1 THRU CONTROL-I-1-F.
	   COMPUTE IMP-2-INT ROUNDED = NETO-CAP * IVA-2-ALI / 100.
	   PERFORM CARGA-I-2.
	   PERFORM CONTROL-I-2 THRU CONTROL-I-2-F.
	   PERFORM DESP-CRE.
	   IF SEC-PRO-EMP > 1 AND SEC-PRO-EMP < 5
	      IF C-ING-BRUTOS < 3
		 PERFORM SUMA-BASE
		 PERFORM CALC-RES THRU CALC-RES-F.
	   COMPUTE RET-IVA = RET-IVA + RES-CAP.
	   PERFORM DESP-RET.
	   IF COD-OPE = "M" GO TO MODI1.
	   PERFORM MEN-CONF.
	   MOVE 28 TO SW3.
	   PERFORM CAP-COD1.
	   IF ESCAP PERFORM CIERRE-A GO TO INI-MOD.
	   IF F10 MOVE "S" TO IMP-CLA
		  GO TO GRABA-IVA.
	   IF F01 GO TO GRABA-IVA.
	   MOVE SPACES TO MEN-1 MEN-2 MEN-3.
	   PERFORM MENS-PAN.
	   PERFORM M-NO-GRABA 50 TIMES.
	   MOVE SPACES TO MEN-1 MEN-2 MEN-3.
	   PERFORM MENS-PAN.
	   GO TO TAREA1-1.
       IVA-VEN21.
	   MOVE 0 TO TOT-CAP TOT-CAP1 CRE-DEB-CAP BASE-CAP RES-CAP.
	   IF TIP-IVA-EMP NOT = "R" GO TO IVA-VEN3.
	   PERFORM PANTA-3.
	   PERFORM CARGA-TOT.
	   IF SEC-PRO-EMP > 1 AND SEC-PRO-EMP < 5
	      IF C-ING-BRUTOS < 3
		 DISPLAY P-004
		 PERFORM CARGA-RES.
	   PERFORM PANTA-3.
	   PERFORM CARGA-P-C.
	   COMPUTE IMP-A1-CAP ROUNDED = ( TOT-CAP1 - RES-CAP )
		      * POR-COM / 100.
	   COMPUTE IMP-A1-CAP ROUNDED = IMP-A1-CAP / (IVA-1-ALI +
		    IVA-2-ALI) * IVA-1-ALI.
	   COMPUTE NETO-CAP ROUNDED = IMP-A1-CAP * 100 / IVA-1-ALI.
	   COMPUTE IMP-1-CAP ROUNDED = NETO-CAP * IVA-1-ALI / 100.
	   COMPUTE IMP-2-CAP ROUNDED = NETO-CAP * IVA-2-ALI / 100.
	   COMPUTE NO-GRA-CAP = TOT-CAP1 - NETO-CAP - IMP-1-CAP -
		       IMP-2-CAP - RES-CAP.
	   COMPUTE TOT-CAP = NETO-CAP + IMP-1-CAP + IMP-2-CAP +
		     NO-GRA-CAP + RES-CAP.
	   IF TOT-CAP1 NOT = TOT-CAP
	       COMPUTE NO-GRA-CAP = NO-GRA-CAP - ( TOT-CAP1 -
			   TOT-CAP).
	   MOVE 0 TO TOT-CAP.
	   MOVE IMP-1-CAP TO IMP-1-IVA.
	   MOVE IMP-2-CAP TO IMP-2-IVA.
	   MOVE NETO-CAP TO NETO-IVA.
	   MOVE NO-GRA-CAP TO NO-GRA-IVA.
	   MOVE RES-CAP TO RET-IVA.
	   PERFORM DESP-I-1.
	   COMPUTE IMP-1-INT ROUNDED = NETO-CAP * IVA-1-ALI / 100.
	   PERFORM CONTROL-I-1 THRU CONTROL-I-1-F.
	   PERFORM DESP-I-2.
	   COMPUTE IMP-2-INT ROUNDED = NETO-CAP * IVA-2-ALI / 100.
	   PERFORM CONTROL-I-2 THRU CONTROL-I-2-F.
	   PERFORM DESP-CRE.
	   PERFORM DESP-N-GRA.
	   PERFORM DESP-RET.
	   PERFORM DESP-NET.
	   PERFORM DESP-TOT.
	   IF COD-OPE = "M" GO TO MODI1.
	   PERFORM MEN-CONF.
	   MOVE 28 TO SW3.
	   PERFORM CAP-COD1.
	   IF ESCAP PERFORM CIERRE-A GO TO INI-MOD.
	   IF F10 MOVE "S" TO IMP-CLA
		  GO TO GRABA-IVA.
	   IF F01 GO TO GRABA-IVA.
	   MOVE SPACES TO MEN-1 MEN-2 MEN-3.
	   PERFORM MENS-PAN.
	   PERFORM M-NO-GRABA 50 TIMES.
	   MOVE SPACES TO MEN-1 MEN-2 MEN-3.
	   PERFORM MENS-PAN.
	   PERFORM BORRA-PAN3.
	   GO TO TAREA1-1.
       IVA-VEN3.
	   MOVE 0 TO TOT-CAP TOT-CAP1 CRE-DEB-CAP RES-CAP BASE-CAP. 
	   PERFORM CARGA-TOT.
	   IF SEC-PRO-EMP > 1 AND SEC-PRO-EMP < 5
	     IF INS-CAP = "E" OR INS-CAP = "e" OR INS-CAP = "M" 
                OR INS-CAP = "m"
	      IF C-ING-BRUTOS < 3
		 DISPLAY P-004
		 PERFORM CARGA-BAS
		 PERFORM CARGA-RES
		 COMPUTE TOT-CAP1 = TOT-CAP1 - RES-CAP.
	   IF TIP-IVA-EMP = "R"
	      IF IVA-EMP = "RESP. INSC./EXE" PERFORM CARGA-EXE
		    COMPUTE TOT-CAP1 = TOT-CAP1 - EXE-CAP.
	   IF TIP-IVA-EMP = "R"
	     COMPUTE NETO-CAP ROUNDED = ( TOT-CAP1 ) 
		       / ( ( IVA-1-ALI / 100 ) + 1 )
	     COMPUTE IMP-1-CAP = TOT-CAP1 - NETO-CAP
	     MOVE NETO-CAP TO NETO-IVA
	    ELSE MOVE TOT-CAP1 TO EXE-CAP EXE-IVA
		 MOVE 0 TO NETO-CAP IMP-1-CAP NETO-IVA.
	   MOVE IMP-1-CAP TO IMP-1-IVA.
	   MOVE RES-CAP TO RET-IVA.
	   PERFORM DESP-RET.
	   PERFORM DESP-I-1.
	   COMPUTE IMP-1-INT ROUNDED = NETO-CAP * ( IVA-1-ALI / 100 )
	   PERFORM CONTROL-I-1 THRU CONTROL-I-1-F.
	   PERFORM DESP-CRE.
	   IF TIP-IVA-EMP = "R"
	     PERFORM DESP-NET
	    ELSE PERFORM DESP-EXE.
	   IF COD-OPE = "M" GO TO MODI1.
	   PERFORM MEN-CONF.
	   MOVE 28 TO SW3.
	   PERFORM CAP-COD1.
	   IF ESCAP PERFORM CIERRE-A GO TO INI-MOD.
	   IF F10 MOVE "S" TO IMP-CLA
		  GO TO GRABA-IVA.
	   IF F01 GO TO GRABA-IVA.
	   MOVE SPACES TO MEN-1 MEN-2 MEN-3.
	   PERFORM MENS-PAN.
	   PERFORM M-NO-GRABA 50 TIMES.
	   MOVE SPACES TO MEN-1 MEN-2 MEN-3.
	   PERFORM MENS-PAN.
	   GO TO TAREA1-1.
       IVA-VEN31.
	   MOVE 0 TO TOT-CAP TOT-CAP1 CRE-DEB-CAP RES-CAP BASE-CAP.
	   PERFORM PANTA-3. 
	   PERFORM CARGA-TOT.
	   IF TIP-IVA-EMP = "R"
	      IF IVA-EMP = "RESP. INSC./EXE" PERFORM CARGA-EXE
		    COMPUTE TOT-CAP1 = TOT-CAP1 - EXE-CAP
	      ELSE MOVE 0 TO EXE-CAP.
	   PERFORM CARGA-P-C.
	   COMPUTE IMP-A1-CAP ROUNDED = TOT-CAP1 * POR-COM / 100.
	   COMPUTE NETO-CAP ROUNDED = IMP-A1-CAP * 100 / IVA-1-ALI.
	   COMPUTE IMP-1-CAP ROUNDED = NETO-CAP * IVA-1-ALI / 100.
	   COMPUTE NO-GRA-CAP = TOT-CAP1 - NETO-CAP - IMP-1-CAP.
	   COMPUTE TOT-CAP = NETO-CAP + IMP-1-CAP + NO-GRA-CAP + EXE-CAP.
	   IF TOT-CAP NOT = TOT-CAP1
	      COMPUTE NO-GRA-CAP = NO-GRA-CAP - ( TOT-CAP1 -
		 TOT-CAP ).
	   MOVE 0 TO TOT-CAP.
	   MOVE NETO-CAP TO NETO-IVA.
	   MOVE IMP-1-CAP TO IMP-1-IVA.
	   MOVE NO-GRA-CAP TO NO-GRA-IVA.
	   MOVE EXE-CAP TO EXE-IVA.
	   PERFORM DESP-I-1.
	   COMPUTE IMP-1-INT ROUNDED = NETO-CAP * ( IVA-1-ALI / 100 )
	   PERFORM CONTROL-I-1 THRU CONTROL-I-1-F.
	   PERFORM DESP-CRE.
	   PERFORM DESP-N-GRA.
	   PERFORM DESP-EXE.
	   PERFORM DESP-NET.
	   PERFORM DESP-TOT.
	   IF COD-OPE = "M" GO TO MODI1.
	   PERFORM MEN-CONF.
	   MOVE 28 TO SW3.
	   PERFORM CAP-COD1.
	   IF ESCAP PERFORM CIERRE-A GO TO INI-MOD.
	   IF F10 MOVE "S" TO IMP-CLA
		  GO TO GRABA-IVA.
	   IF F01 GO TO GRABA-IVA.
	   MOVE SPACES TO MEN-1 MEN-2 MEN-3.
	   PERFORM MENS-PAN.
	   PERFORM M-NO-GRABA 50 TIMES.
	   MOVE SPACES TO MEN-1 MEN-2 MEN-3.
	   PERFORM MENS-PAN.
	   PERFORM BORRA-PAN3.
	   GO TO TAREA1-1.
       IVA-VEN4.
	   MOVE 0 TO TOT-CAP CRE-DEB-CAP RES-CAP BASE-CAP.
	   IF TIP-IVA-EMP NOT = "R"
	       GO TO TAREA1-1.
	   PERFORM CARGA-RET.
	   PERFORM DESP-CRE.
	   IF COD-OPE = "M" GO TO MODI1.
	   PERFORM MEN-CONF.
	   MOVE 28 TO SW3.
	   PERFORM CAP-COD1.
	   IF ESCAP PERFORM CIERRE-A GO TO INI-MOD.
	   IF F10 MOVE "S" TO IMP-CLA
		    GO TO GRABA-IVA.
	   IF F01 GO TO GRABA-IVA.
	   MOVE SPACES TO MEN-1 MEN-2 MEN-3.
	   PERFORM MENS-PAN.
	   PERFORM M-NO-GRABA 50 TIMES.
	   MOVE SPACES TO MEN-1 MEN-2 MEN-3.
	   PERFORM MENS-PAN.
	   GO TO TAREA1-1.
       IVA-COM1.
	   MOVE 0 TO TOT-CAP CRE-DEB-CAP RES-CAP BASE-CAP.
	   PERFORM CARGA-NET.
	   PERFORM CARGA-N-GRA.
	   PERFORM CARGA-EXE.
      *     PERFORM CARGA-DED.
	   PERFORM CARGA-RET.
	   COMPUTE IMP-1-INT ROUNDED = NETO-CAP * IVA-1-ALI / 100.
	   PERFORM CARGA-I-1.
	   PERFORM CONTROL-I-1 THRU CONTROL-I-1-F.
	   IF TIP-IVA-EMP = "N"
	    COMPUTE IMP-2-INT ROUNDED = NETO-CAP * IVA-2-ALI / 100
	    PERFORM CARGA-I-2
	    PERFORM CONTROL-I-2 THRU CONTROL-I-2-F.
	   PERFORM DESP-CRE.
	   COMPUTE PER-INT ROUNDED = NETO-CAP * IVA-3-ALI / 100.
	   PERFORM CARGA-PER.
	   PERFORM CONTROL-PER THRU CONTROL-PER-F.
	   IF C-ING-BRUTOS > 11 AND C-ING-BRUTOS < 15
	      IF SIT-PRO-EMP < 3
		 PERFORM SUMA-BASE
		 PERFORM CALC-RES THRU CALC-RES-F.
	   COMPUTE RET-IVA = RET-IVA + RES-CAP.
	   PERFORM DESP-RET.
	   IF COD-OPE = "M" GO TO MODI1.
	   PERFORM MEN-CONF.
	   MOVE 28 TO SW3.
	   PERFORM CAP-COD1.
	   IF ESCAP PERFORM CIERRE-A GO TO INI-MOD.
	   IF F10 MOVE "S" TO IMP-CLA
		  GO TO GRABA-IVA.
	   IF F01 GO TO GRABA-IVA.
	   MOVE SPACES TO MEN-1 MEN-2 MEN-3.
	   PERFORM MENS-PAN.
	   PERFORM M-NO-GRABA 50 TIMES.
	   MOVE SPACES TO MEN-1 MEN-2 MEN-3.
	   PERFORM MENS-PAN.
	   GO TO TAREA1-1.
       IVA-COM2.
	   MOVE 0 TO TOT-CAP CRE-DEB-CAP RES-CAP BASE-CAP.
      *    PERFORM CARGA-NET.
      *     PERFORM CARGA-N-GRA.
	   PERFORM CARGA-EXE.
      *     PERFORM CARGA-DED.
	   PERFORM CARGA-RET.
	   PERFORM DESP-CRE.
	   IF C-ING-BRUTOS > 11 AND C-ING-BRUTOS < 15
	      IF SIT-PRO-EMP < 3
		 PERFORM SUMA-BASE
		 PERFORM CALC-RES THRU CALC-RES-F.
	   COMPUTE RET-IVA = RET-IVA + RES-CAP.
	   PERFORM DESP-RET.
	   IF COD-OPE = "M" GO TO MODI1.
	   PERFORM MEN-CONF.
	   MOVE 28 TO SW3.
	   PERFORM CAP-COD1.
	   IF ESCAP PERFORM CIERRE-A GO TO INI-MOD.
	   IF F10 MOVE "S" TO IMP-CLA
		  GO TO GRABA-IVA.
	   IF F01 GO TO GRABA-IVA.
	   MOVE SPACES TO MEN-1 MEN-2 MEN-3.
	   PERFORM MENS-PAN.
	   PERFORM M-NO-GRABA 50 TIMES.
	   MOVE SPACES TO MEN-1 MEN-2 MEN-3.
	   PERFORM MENS-PAN.
	   GO TO TAREA1-1.
       IVA-COM3.
	   MOVE 0 TO TOT-CAP TOT-CAP1 CRE-DEB-CAP RES-CAP BASE-CAP.
	   PERFORM PANTA-3.
	   PERFORM CARGA-TOT.
	   IF C-ING-BRUTOS > 11 AND C-ING-BRUTOS < 15
	      IF SIT-PRO-EMP < 3
		 DISPLAY P-004
		 PERFORM CARGA-RES.
	   PERFORM PANTA-3.
	   PERFORM CARGA-P-C.
	   COMPUTE IMP-A1-CAP ROUNDED = ( TOT-CAP1 - RES-CAP )
			* POR-COM / 100.
	   COMPUTE NETO-CAP ROUNDED = IMP-A1-CAP * 100 / IVA-1-ALI.
	   COMPUTE IMP-1-CAP ROUNDED = NETO-CAP * IVA-1-ALI / 100.
	   COMPUTE NO-GRA-CAP = TOT-CAP1 - IMP-1-CAP - NETO-CAP
				 - RES-CAP.
	   COMPUTE TOT-CAP = NETO-CAP + IMP-1-CAP + NO-GRA-CAP
			      + RES-CAP.
	   IF TOT-CAP NOT = TOT-CAP1
	     COMPUTE NO-GRA-CAP = NO-GRA-CAP - ( TOT-CAP1 -
		       TOT-CAP ).
	   MOVE 0 TO TOT-CAP.
	   MOVE NETO-CAP TO NETO-IVA.
	   MOVE NO-GRA-CAP TO NO-GRA-IVA.
	   MOVE IMP-1-CAP TO IMP-1-IVA.
	   MOVE RES-CAP TO RET-IVA.
	   PERFORM DESP-TOT.
	   PERFORM DESP-I-1.
	   COMPUTE IMP-1-INT ROUNDED = NETO-CAP * IVA-1-ALI / 100.
	   PERFORM CONTROL-I-1 THRU CONTROL-I-1-F.
	   IF TIP-IVA-EMP = "N"
	    COMPUTE IMP-2-INT ROUNDED = NETO-CAP * IVA-2-ALI / 100
	    PERFORM CARGA-I-2
	    PERFORM CONTROL-I-2 THRU CONTROL-I-2-F.
	   PERFORM DESP-CRE.
	   PERFORM DESP-N-GRA.
	   PERFORM DESP-NET.
	   PERFORM DESP-RET.
	   PERFORM DESP-TOT.
	   IF COD-OPE = "M" GO TO MODI1.
	   PERFORM MEN-CONF.
	   MOVE 28 TO SW3.
	   PERFORM CAP-COD1.
	   IF ESCAP PERFORM CIERRE-A GO TO INI-MOD.
	   IF F10 MOVE "S" TO IMP-CLA
		  GO TO GRABA-IVA.
	   IF F01 GO TO GRABA-IVA.
	   MOVE SPACES TO MEN-1 MEN-2 MEN-3.
	   PERFORM MENS-PAN.
	   PERFORM M-NO-GRABA 50 TIMES.
	   MOVE SPACES TO MEN-1 MEN-2 MEN-3.
	   PERFORM MENS-PAN.
	   PERFORM BORRA-PAN3.
	   GO TO TAREA1-1.
       BAJA.
	   MOVE "B" TO COD-OPE.
	   PERFORM MEN-CONF.
	   MOVE 28 TO SW3.
	   PERFORM CAP-COD1.
	   IF ESCAP PERFORM CIERRE-A GO TO INI-MOD.
	   IF F10 MOVE "S" TO IMP-CLA
		  PERFORM BORRA-IVA
		  MOVE SPACES TO MEN-1 MEN-2 MEN-3
		  PERFORM MENS-PAN
		  GO TO CONS-NUM2.
	   IF F01 PERFORM BORRA-IVA
		  MOVE SPACES TO MEN-1 MEN-2 MEN-3
		  PERFORM MENS-PAN
		  GO TO CONS-NUM2.
	   PERFORM MEN-NO-BAJA 50 TIMES.
	   MOVE SPACES TO MEN-1 MEN-2 MEN-3.
	   PERFORM MENS-PAN.
	   GO TO CONS-NUM2.
       RESO.
	   MOVE "M" TO COD-OPE.
	   MOVE SPACES TO IMP-CLA.
	   IF IVA-IVA = 1
	      IF SEC-PRO-EMP > 1 AND SEC-PRO-EMP < 5
		IF C-ING-BRUTOS < 3
		     GO TO RESO-1.
	   IF IVA-IVA > 1
	      IF C-ING-BRUTOS > 11 AND C-ING-BRUTOS < 15
		IF SEC-PRO-EMP < 3
		     GO TO RESO-1.
	   GO TO CONS-NUM2.
       RESO-1. 
	   DISPLAY P-004.
	   PERFORM CARGA-RES.
	   MOVE 0 TO BASE-CAP.
	   COMPUTE RET-IVA = RET-IVA + RES-CAP.
	   CLOSE IVA.
	   OPEN I-O IVA.
	   REWRITE REG-IVA.
	   CLOSE IVA.
	   IF RES-CAP NOT = 0
	      MOVE EMP-IVA TO EMP-RES EMP-CTA
	      MOVE SUC-IVA TO SUC-RES SUC-CTA
	      MOVE CUE-IVA TO CUENTA
	      MOVE 0 TO SUB-CUENTA
	      MOVE RUBRO-IVA TO RUBRO-CTA
	      PERFORM LEO-CTA-RESO THRU LEO-CTA-RESO-F
	      MOVE IVA-IVA TO IVA-RES
	      MOVE ING-BRUTOS TO I-BRU-RES
	      MOVE DESCR-IVA TO DESC-RES
	      MOVE ANO-IVA TO ANO-RES
	      MOVE MES-IVA TO MES-RES
	      MOVE DIA-IVA TO DIA-RES
	      MOVE MOV-IVA TO MOV-RES
	      MOVE RUBRO-IVA TO RUBRO-RES
	      MOVE CUE-IVA TO CUE-RES
	      MOVE C-ING-BRUTOS TO CAT-RES
	      MOVE TIP-COM-IVA TO TIP-COM-RES
	      MOVE SUB-T-C-IVA TO SUB-T-C-RES
	      MOVE SUC-C-IVA TO SUC-C-RES
	      MOVE COM-IVA TO COM-RES
	      MOVE RES-CAP TO PER-RES
	      MOVE ALI-PER(C-ING-BRUTOS) TO POR-RES
	      MOVE 0 TO IMP-RES
	      MOVE DIA-VAL-IVA TO DIA-VAL-RES
	      MOVE MES-VAL-IVA TO MES-VAL-RES
	      MOVE ANO-VAL-IVA TO ANO-VAL-RES
	      OPEN I-O RES127
	      WRITE REG-RES INVALID KEY REWRITE REG-RES
	      END-WRITE 
	      CLOSE RES127
	      PERFORM BORRA-PAN3. 
	   OPEN INPUT IVA.
	   START IVA KEY IS = CLAVE-IVA
		       END-START.
	   READ IVA NEXT AT END PERFORM CIERRE-A
			GO TO CONS-NUM1
			END-READ.
	   GO TO CONS-NUM2.
       LEO-CTA-RESO.
	   READ CUENTAS INVALID KEY GO TO LEO-CTA-RESO1.
	   GO TO LEO-CTA-RESO-F.
       LEO-CTA-RESO1.
	   DISPLAY "CAT:" LINE 16 POSITION 52.
	   DISPLAY "I.B:" LINE 17 POSITION 52.
	   DISPLAY SPACES LINE 16 POSITION 56 SIZE 16.
	   DISPLAY SPACES LINE 17 POSITION 56 SIZE 16.
	   ACCEPT C-ING-BRUTOS LINE 16 POSITION 56 SIZE 3
		      NO BEEP TAB CONVERT
		      ON EXCEPTION EXCEP MOVE SW3 TO SW3.
	   IF ESCAP OPEN INPUT IVA PERFORM CIERRE-A GO TO INI-MOD.
	   IF IVA-IVA = 1
	     IF C-ING-BRUTOS > 0 AND C-ING-BRUTOS < 5
		   GO TO LEO-CTA-RESO2.
	   IF IVA-IVA > 1
	     IF C-ING-BRUTOS = 4 GO TO LEO-CTA-RESO2.
	   IF IVA-IVA > 1
	     IF C-ING-BRUTOS NOT = 4
	       IF C-ING-BRUTOS > 10 AND C-ING-BRUTOS < 17
			GO TO LEO-CTA-RESO2.
	   GO TO LEO-CTA-RESO1.
       LEO-CTA-RESO2.
	   ACCEPT ING-BRUTOS LINE 17 POSITION 56 SIZE 15
			NO BEEP TAB
			ON EXCEPTION EXCEP MOVE SW3 TO SW3.
	   IF ESCAP OPEN INPUT IVA PERFORM CIERRE-A GO TO INI-MOD.
	   IF F02 GO TO LEO-CTA-RESO1.
       LEO-CTA-RESO-F.
	   EXIT.
       MODI.
	   MOVE "M" TO COD-OPE.
	   GO TO ALTA.
       MODI1.
	   PERFORM MEN-CONF.
	   MOVE 28 TO SW3.
	   PERFORM CAP-COD1.
	   IF ESCAP PERFORM CIERRE-A GO TO INI-MOD.
	   IF F01 MOVE "M" TO COD-OPE
		  MOVE SPACES TO MEN-1 MEN-2 MEN-3
		  PERFORM MENS-PAN
		  CLOSE IVA
		  OPEN I-O IVA
		  REWRITE REG-IVA
		  CLOSE IVA
		  OPEN INPUT IVA
		  START IVA KEY IS = CLAVE-IVA
		       END-START
		  READ IVA NEXT AT END PERFORM CIERRE-A
			GO TO CONS-NUM1
			END-READ
		  GO TO CONS-NUM2.
	   PERFORM MEN-NO-MODI 50 TIMES.
	   MOVE SPACES TO MEN-1 MEN-2 MEN-3.
	   PERFORM MENS-PAN.
	   GO TO CONS-NUM2.
       BORRA-IVA.
	   PERFORM CHEQUEA-CLAVE2.
	   IF COD-CLAVE = 9 PERFORM CIERRE-A GO TO INI-MOD.
	   PERFORM CHEQUEA-CLAVE3.
	   IF COD-CLAVE = 9 PERFORM CIERRE-A GO TO INI-MOD.
	   MOVE EMP-IVA TO EMP-CTA.
	   MOVE SUC-IVA TO SUC-CTA.
	   MOVE RUBRO-IVA TO RUBRO-CTA.
	   MOVE CUE-IVA TO CUENTA.
	   MOVE 0 TO SUB-CUENTA.
	   READ CUENTAS INVALID KEY MOVE SPACES TO ING-BRUTOS. 
	   IF IVA-IVA = 1
	     IF IMP-CLA = "N"
		PERFORM VEO-IMP.
	   IF IMP-CLA = "S"
		MOVE 0 TO GAS-TOT PRO-TOT MUN-TOT INT-NET IMP-SUM
		MOVE "N" TO IMP-PRO IMP-MUN.
	   IF IVA-IVA = 1
	     IF IMP-CLA = "S"
		PERFORM CAP-IMP THRU CAP-IMP-F.
	   IF IVA-IVA > 1
	     IF IMP-CLA = "S"
		PERFORM CAP-OT THRU CAP-OT-F.
	   CLOSE IVA.
	   OPEN I-O IVA.
	   DELETE IVA.
	   CLOSE IVA.
	   MOVE EMP-IVA TO EMP-RES EMP-INS.
	   MOVE SUC-IVA TO SUC-RES SUC-INS.
	   MOVE IVA-IVA TO IVA-RES IVA-INS.
	   MOVE ING-BRUTOS TO I-BRU-RES I-BRU-INS.
	   MOVE DESCR-IVA TO DESC-RES DESC-INS.
	   MOVE ANO-IVA TO ANO-RES ANO-INS.
	   MOVE MES-IVA TO MES-RES MES-INS.
	   MOVE DIA-IVA TO DIA-RES DIA-INS.
	   MOVE MOV-IVA TO MOV-RES MOV-INS.
	   OPEN I-O RES127.
	   DELETE RES127 INVALID KEY MOVE 0 TO MOV-RES.
	   CLOSE RES127.
	   OPEN I-O INSDIR.
	   DELETE INSDIR INVALID KEY MOVE 0 TO MOV-INS.
	   CLOSE INSDIR.
	   OPEN INPUT IVA.
	   START IVA KEY IS > CLAVE-IVA.
	   READ IVA NEXT AT END PERFORM CIERRE-A
				GO TO CONS-NUM1.
       GRABA-IVA.
	   PERFORM BORRA-PAN3.
	   CLOSE IVA EMPRESAS.
	   OPEN I-O IVA EMPRESAS.
	   READ EMPRESAS INVALID KEY DISPLAY "ERROR EMPRESA"
		      MOVE 1 TO IVA-CON
		      MOVE 1 TO ACT-MUN-EMP ACT-PRO-EMP.
	   IF COD-OPE = "A"
	      ADD 1 TO IVA-CON.
	   MOVE IVA-CON TO MOV-IVA  IVA-C-EMP.
	   WRITE REG-IVA INVALID KEY REWRITE REG-IVA.
	   IF COD-OPE = "A"
		REWRITE REG-EMP INVALID KEY WRITE  REG-EMP.
	   CLOSE IVA EMPRESAS.
	   IF IVA-IVA = 1
	     IF IMP-CLA = "N"
		PERFORM VEO-IMP.
	   IF IMP-CLA = "S"
		MOVE 0 TO GAS-TOT PRO-TOT MUN-TOT INT-NET IMP-SUM
		MOVE "N" TO IMP-PRO IMP-MUN.
	   IF IVA-IVA = 1
	     IF IMP-CLA = "S"
		PERFORM CAP-IMP THRU CAP-IMP-F.
	   IF IVA-IVA > 1
	     IF IMP-CLA = "S"
		PERFORM CAP-OT THRU CAP-OT-F.
	   IF COD-OPE = "A" 
	     IF RES-CAP NOT = 0
	      MOVE EMP-IVA TO EMP-RES
	      MOVE SUC-IVA TO SUC-RES
	      MOVE IVA-IVA TO IVA-RES
	      MOVE ING-BRUTOS TO I-BRU-RES
	      MOVE DESCR-IVA TO DESC-RES
	      MOVE ANO-IVA TO ANO-RES
	      MOVE MES-IVA TO MES-RES
	      MOVE DIA-IVA TO DIA-RES
	      MOVE MOV-IVA TO MOV-RES
	      MOVE RUBRO-IVA TO RUBRO-RES
	      MOVE CUE-IVA TO CUE-RES
	      MOVE C-ING-BRUTOS TO CAT-RES
	      MOVE TIP-COM-IVA TO TIP-COM-RES
	      MOVE SUB-T-C-IVA TO SUB-T-C-RES
	      MOVE SUC-C-IVA TO SUC-C-RES
	      MOVE COM-IVA TO COM-RES
	      MOVE BASE-CAP TO IMP-RES
	      MOVE RES-CAP TO PER-RES
	      MOVE ALI-PER(C-ING-BRUTOS) TO POR-RES
	      MOVE DIA-VAL-IVA TO DIA-VAL-RES
	      MOVE MES-VAL-IVA TO MES-VAL-RES
	      MOVE ANO-VAL-IVA TO ANO-VAL-RES
	      OPEN I-O RES127
	      WRITE REG-RES 
	      CLOSE RES127. 
	   OPEN INPUT IVA EMPRESAS.
	   MOVE "N" TO IMP-CLA IMP-PRO IMP-MUN.
	   GO TO TAREA1-2.
       VEO-IMP.
	   OPEN INPUT ACTI.
	   OPEN I-O IMPU.
	   MOVE NUM-EMP TO EMP-IMP.
	   MOVE SUC-EMP TO SUC-IMP.
	   MOVE 2 TO IMP-ACT IMP-IMP.
	   MOVE ANO-IVA TO AA-IMP.
	   MOVE MES-IVA TO MM-IMP.
	   MOVE DIA-IVA TO DD-IMP.
	   MOVE COM-IVA TO COMPRO-IMP
	   MOVE ACT-PRO-EMP TO ACT-ACT ACT-IMP.
	   IF SEC-PRO-EMP = 2
	      IF INSCRIPTO = "C"
		 COMPUTE ACT-ACT = ACT-PRO-EMP - 300
		 MOVE ACT-ACT TO ACT-IMP.
	   IF SEC-PRO-EMP > 2
	      IF INSCRIPTO = "C"
		 COMPUTE ACT-ACT = ACT-PRO-EMP - 600
		 MOVE ACT-ACT TO ACT-IMP.
	   READ ACTI INVALID KEY MOVE 0 TO POR-ACT CAL-ACT VAL-2-ACT
			  MOVE 0 TO VAL-1-ACT ACT-ACT.
	   READ IMPU INVALID KEY 
		   MOVE 0 TO NET-IMP
		   MOVE CAL-ACT TO CAL-IMP
		   MOVE POR-ACT TO POR-IMP
		   MOVE VAL-2-ACT TO MIN-IMP.
	   IF CAL-IMP NOT = CAL-ACT MOVE CAL-ACT TO CAL-IMP.
	   IF POR-ACT NOT = POR-IMP MOVE POR-ACT TO POR-IMP.
	   IF VAL-2-ACT NOT = MIN-IMP MOVE VAL-2-ACT TO MIN-IMP.
	   IF CAL-ACT < 3
	     IF COD-OPE = "A"
	       COMPUTE NET-IMP = NET-IMP + NETO-IVA + EXE-IVA
	     ELSE COMPUTE NET-IMP = NET-IMP - ( NETO-IVA - EXE-IVA ).
	   IF CAL-ACT > 2 
	     IF COD-OPE = "A"
	       COMPUTE NET-IMP = NET-IMP + VAL-1-ACT
	     ELSE COMPUTE NET-IMP = NET-IMP - VAL-1-ACT.
	   IF ACT-ACT NOT = 0 
	     REWRITE REG-IMPU INVALID KEY WRITE REG-IMPU.
	   MOVE 3 TO IMP-ACT IMP-IMP.
	   MOVE ACT-MUN-EMP TO ACT-ACT ACT-IMP.
	   READ ACTI INVALID KEY MOVE 0 TO POR-ACT CAL-ACT VAL-2-ACT
		      MOVE 0 TO VAL-1-ACT ACT-ACT.
	   READ IMPU INVALID KEY
		   MOVE 0 TO NET-IMP
		   MOVE CAL-ACT TO CAL-IMP
		   MOVE POR-ACT TO POR-IMP
		   MOVE VAL-2-ACT TO MIN-IMP.
	   IF CAL-IMP NOT = CAL-ACT MOVE CAL-ACT TO CAL-IMP.
	   IF POR-IMP NOT = POR-ACT MOVE POR-ACT TO POR-IMP.
	   IF VAL-2-ACT NOT = MIN-IMP MOVE VAL-2-ACT TO MIN-IMP.
	   IF CAL-ACT < 3
	     IF COD-OPE = "A"
	       COMPUTE NET-IMP = NET-IMP + NETO-IVA + EXE-IVA
	     ELSE COMPUTE NET-IMP = NET-IMP - ( NETO-IVA - EXE-IVA ).
	   IF CAL-ACT > 2 
	     IF COD-OPE = "A"
	       COMPUTE NET-IMP = NET-IMP + VAL-1-ACT
	     ELSE COMPUTE NET-IMP = NET-IMP - VAL-1-ACT.
	   IF ACT-ACT NOT = 0
	      REWRITE REG-IMPU INVALID KEY WRITE REG-IMPU.
	   CLOSE IMPU ACTI.
       CAP-IMP.
	   COMPUTE IMP-SUM = NETO-IVA + EXE-IVA + NO-GRA-IVA.
	   PERFORM PANTA-4.
	   PERFORM MEN-ANTE.
	   ACCEPT INT-IMP LINE 15 POSITION 60 SIZE 1 NO BEEP TAB
	       ON EXCEPTION EXCEP MOVE SW3 TO SW3.
	   IF F02 GO TO CAP-IMP-5.
	   IF INT-IMP < 2 OR INT-IMP > 3 GO TO CAP-IMP.
	   IF INT-IMP = 2 
	      DISPLAY "ING.BRUTOS" LINE 15 POSITION 62.
	   IF INT-IMP = 3
	      DISPLAY "TASA MUNIC" LINE 15 POSITION 62.
       CAP-IMP-1.
	   PERFORM MEN-ANTE.
	   ACCEPT INT-ACT LINE 16 POSITION 62 SIZE 3 NO BEEP TAB
		ON EXCEPTION EXCEP MOVE SW3 TO SW3.
	   IF F02 GO TO CAP-IMP.
	   IF INT-IMP = 2
	      IF SEC-PRO-EMP = 1
		 IF INT-ACT > 300 GO TO CAP-IMP-1.
	   IF INT-IMP = 2
	      IF SEC-PRO-EMP = 2
		 IF INT-ACT > 599 GO TO CAP-IMP-1.
	   IF INT-IMP = 2
	      IF SEC-PRO-EMP > 2
		 IF INT-ACT > 300 AND INT-ACT < 601 
			GO TO CAP-IMP-1.
	   IF INT-IMP = 2
	      IF SEC-PRO-EMP > 1
		IF INSCRIPTO = "C"
		  IF INT-ACT > 299 GO TO CAP-IMP-1. 
	   MOVE INT-IMP TO IMP-ACT.
	   MOVE INT-ACT TO ACT-ACT.
	   OPEN INPUT ACTI.
	   READ ACTI INVALID KEY CLOSE ACTI
		       GO TO CAP-IMP-1.
	   CLOSE ACTI.
	   DISPLAY DET-ACT LINE 17 POSITION 51 SIZE 20.
       CAP-IMP-2.
	   IF CAL-ACT > 2
	       MOVE VAL-1-ACT TO INT-NET EDI-NET
	       DISPLAY EDI-NET LINE 18 POSITION 60
	       GO TO CAP-IMP-3.
	   ACCEPT INT-NET LINE 18 POSITION 60 NO BEEP TAB
	      ON EXCEPTION EXCEP MOVE SW3 TO SW3.
	   IF F02 GO TO CAP-IMP-1.
	   MOVE INT-NET TO EDI-NET.
	   IF ACT-ACT = 300
	       MOVE INT-NET TO BASE-CAP.
	   DISPLAY EDI-NET LINE 18 POSITION 60.
       CAP-IMP-3.
	   PERFORM MEN-CONF.
	   MOVE 28 TO SW3.
	   PERFORM CAP-COD1.
	   IF F02 GO TO CAP-IMP-2.
	   IF F01 GO TO CAP-IMP-4.
	   MOVE SPACES TO MEN-1 MEN-2 MEN-3.
	   PERFORM MENS-PAN.
	   PERFORM M-NO-GRABA 50 TIMES.
	   MOVE SPACES TO MEN-1 MEN-2 MEN-3.
	   PERFORM MENS-PAN.
	   GO TO CAP-IMP-1.
       CAP-IMP-4.
	   MOVE INT-IMP TO IMP-ACT IMP-IMP.
	   MOVE INT-ACT TO ACT-ACT ACT-IMP.
	   MOVE MES-IVA TO MM-IMP.
	   MOVE ANO-IVA TO AA-IMP.
	   MOVE DIA-IVA TO DD-IMP.
	   MOVE COM-IVA TO COMPRO-IMP.
	   MOVE NUM-EMP TO EMP-IMP.
	   MOVE SUC-EMP TO SUC-IMP.
	   IF IMP-IMP = 2 MOVE "S" TO IMP-PRO
		  COMPUTE PRO-TOT = PRO-TOT + INT-NET.
	   IF IMP-IMP = 3 MOVE "S" TO IMP-MUN
		  COMPUTE MUN-TOT = MUN-TOT + INT-NET.
      *=-=-=-=-=-=- OJOTA =-=-=-=-=-=-=-=-=-=-=-==-
      *     DISPLAY PRO-TOT LINE 10 POSITION 2.
      *     DISPLAY MUN-TOT LINE 11 POSITION 2.
      *     DISPLAY IMP-SUM LINE 12 POSITION 2.
      *=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-
	   IF TIP-COM-IVA NOT = 4 
	     IF PRO-TOT > IMP-SUM
		    COMPUTE PRO-TOT = PRO-TOT - INT-NET 
		    GO TO CAP-IMP-2.
	   IF TIP-COM-IVA NOT = 4
	     IF MUN-TOT > IMP-SUM 
		    COMPUTE MUN-TOT = MUN-TOT - INT-NET
		    GO TO CAP-IMP-2.
	   IF TIP-COM-IVA = 4 
	     IF PRO-TOT < IMP-SUM
		    COMPUTE PRO-TOT = PRO-TOT - INT-NET 
		    GO TO CAP-IMP-2.
	   IF TIP-COM-IVA = 4
	     IF MUN-TOT < IMP-SUM 
		    COMPUTE MUN-TOT = MUN-TOT - INT-NET
		    GO TO CAP-IMP-2.           
	   OPEN I-O IMPU.
	   READ IMPU INVALID KEY MOVE 0 TO NET-IMP.
	   IF COD-OPE = "A"
	       COMPUTE NET-IMP = NET-IMP + INT-NET
	       ELSE COMPUTE NET-IMP = NET-IMP - INT-NET.
	   IF CAL-ACT NOT = CAL-IMP MOVE CAL-ACT TO CAL-IMP.
	   IF VAL-2-ACT NOT = MIN-IMP MOVE VAL-2-ACT TO MIN-IMP.
	   IF POR-ACT NOT = POR-IMP MOVE POR-ACT TO POR-IMP.
	   REWRITE REG-IMPU INVALID KEY WRITE REG-IMPU.
	   CLOSE IMPU.
	   IF COD-OPE = "A"
	     IF IMP-IMP = 2
	      IF ACT-IMP = 300
		 MOVE EMP-IVA TO EMP-INS
		 MOVE SUC-IVA TO SUC-INS
		 MOVE IVA-IVA TO IVA-INS
		 MOVE ING-BRUTOS TO I-BRU-INS
		 MOVE DESCR-IVA TO DESC-INS
		 MOVE ANO-IVA TO ANO-INS
		 MOVE MES-IVA TO MES-INS
		 MOVE DIA-IVA TO DIA-INS
		 MOVE MOV-IVA TO MOV-INS
		 MOVE RUBRO-IVA TO RUBRO-INS
		 MOVE CUE-IVA TO CUE-INS
		 MOVE C-ING-BRUTOS TO CAT-INS
		 MOVE TIP-COM-IVA TO TIP-COM-INS
		 MOVE SUB-T-C-IVA TO SUB-T-C-INS
		 MOVE SUC-C-IVA TO SUC-C-INS
		 MOVE COM-IVA TO COM-INS
		 MOVE BASE-CAP TO IMP-INS
		 MOVE POR-ACT TO POR-INS
		 MOVE DIA-VAL-IVA TO DIA-VAL-INS
		 MOVE MES-VAL-IVA TO MES-VAL-INS
		 MOVE ANO-VAL-IVA TO ANO-VAL-INS
		 OPEN I-O INSDIR
		 WRITE REG-INS
		 CLOSE INSDIR.                 
	   GO TO CAP-IMP.
       CAP-IMP-5.
	   COMPUTE INT-NET = NETO-IVA + EXE-IVA + NO-GRA-IVA.
	   IF IMP-PRO = "S"
	      IF PRO-TOT NOT = INT-NET PERFORM CAP-IMP-51.
	   IF IMP-PRO = "N"
	       PERFORM CAP-IMP-52.
	   IF IMP-MUN = "S"
	      IF MUN-TOT = INT-NET GO TO CAP-IMP-7.
	   GO TO CAP-IMP-6.
       CAP-IMP-51.
	   MOVE 2 TO IMP-IMP IMP-ACT.
	   MOVE ACT-PRO-EMP TO ACT-IMP ACT-ACT.
	   OPEN INPUT ACTI.
	   READ ACTI INVALID KEY MOVE 0 TO CAL-IMP POR-IMP MIN-IMP
			 MOVE 0 TO ACT-ACT.
	   CLOSE ACTI.
	   OPEN I-O IMPU.
	   READ IMPU INVALID KEY MOVE 0 TO NET-IMP.
	   IF COD-OPE = "A"
	     COMPUTE NET-IMP = NET-IMP + ( INT-NET - PRO-TOT )
	     ELSE COMPUTE NET-IMP = NET-IMP - ( INT-NET - PRO-TOT ).
	   IF CAL-ACT NOT = CAL-IMP MOVE CAL-ACT TO CAL-IMP.
	   IF POR-ACT NOT = POR-IMP MOVE POR-ACT TO POR-IMP.
	   IF VAL-2-ACT NOT = MIN-IMP MOVE VAL-2-ACT TO MIN-IMP.
	   IF ACT-ACT NOT = 0
		REWRITE REG-IMPU INVALID KEY WRITE REG-IMPU.
	   CLOSE IMPU.
       CAP-IMP-52.
	   MOVE 2 TO IMP-IMP IMP-ACT.
	   MOVE ACT-PRO-EMP TO ACT-IMP ACT-ACT.
	   OPEN INPUT ACTI.
	   READ ACTI INVALID KEY MOVE 0 TO CAL-IMP POR-IMP MIN-IMP
		  MOVE 0 TO ACT-ACT.
	   CLOSE ACTI.
	   OPEN I-O IMPU.
	   READ IMPU INVALID KEY MOVE 0 TO NET-IMP.
	   IF COD-OPE = "A"
	     COMPUTE NET-IMP = NET-IMP + ( INT-NET - PRO-TOT )
	     ELSE COMPUTE NET-IMP = NET-IMP - ( INT-NET - PRO-TOT ).
	   IF CAL-ACT NOT = CAL-IMP MOVE CAL-ACT TO CAL-IMP.
	   IF POR-ACT NOT = POR-IMP MOVE POR-ACT TO POR-IMP.
	   IF VAL-2-ACT NOT = MIN-IMP MOVE VAL-2-ACT TO MIN-IMP.
	   IF ACT-ACT NOT = 0
	     REWRITE REG-IMPU INVALID KEY WRITE REG-IMPU.
	   CLOSE IMPU.
       CAP-IMP-6.
	   MOVE 3 TO IMP-IMP IMP-ACT.
	   MOVE ACT-MUN-EMP TO ACT-IMP ACT-ACT.
	   OPEN INPUT ACTI.
	   READ ACTI INVALID KEY MOVE 0 TO CAL-IMP POR-IMP MIN-IMP
		 MOVE 0 TO ACT-ACT.
	   CLOSE ACTI.
	   OPEN I-O IMPU.
	   READ IMPU INVALID KEY MOVE 0 TO NET-IMP.
	   IF COD-OPE = "A"
	     COMPUTE NET-IMP = NET-IMP + ( INT-NET - MUN-TOT )
	     ELSE COMPUTE NET-IMP = NET-IMP - ( INT-NET - MUN-TOT ).
	   IF CAL-ACT NOT = CAL-IMP MOVE CAL-ACT TO CAL-IMP.
	   IF POR-ACT NOT = POR-IMP MOVE POR-ACT TO POR-IMP.
	   IF VAL-2-ACT NOT = MIN-IMP MOVE VAL-2-ACT TO MIN-IMP.
	   IF ACT-ACT NOT = 0
	     REWRITE REG-IMPU INVALID KEY WRITE REG-IMPU.
	   CLOSE IMPU.
       CAP-IMP-7.
	   PERFORM PANTA-5.
	   MOVE "N" TO IMP-PRO IMP-MUN.
       CAP-IMP-F.
	   EXIT.
       CAP-OT.
	   COMPUTE IMP-SUM = TOT-CAP.
	   PERFORM PANTA-4.
	   PERFORM MEN-ANTE.
	   ACCEPT INT-IMP LINE 15 POSITION 60 SIZE 1 NO BEEP TAB
	       ON EXCEPTION EXCEP MOVE SW3 TO SW3.
	   IF F02 PERFORM PANTA-5
		  GO TO CAP-OT-F.
	   IF INT-IMP < 8 OR INT-IMP > 9 GO TO CAP-IMP.
	   IF INT-IMP = 8 
	      DISPLAY "OT.COMPRAS" LINE 15 POSITION 62.
	   IF INT-IMP = 9
	      DISPLAY "OT. GASTOS" LINE 15 POSITION 62.
       CAP-OT-1.
	   PERFORM MEN-ANTE.
	   ACCEPT INT-ACT LINE 16 POSITION 62 SIZE 3 NO BEEP TAB
		ON EXCEPTION EXCEP MOVE SW3 TO SW3.
	   IF F02 GO TO CAP-IMP.
	   MOVE INT-IMP TO IMP-ACT.
	   MOVE INT-ACT TO ACT-ACT.
	   OPEN INPUT ACTI.
	   READ ACTI INVALID KEY CLOSE ACTI
		       GO TO CAP-OT-1.
	   CLOSE ACTI.
	   DISPLAY DET-ACT LINE 17 POSITION 51 SIZE 20.
       CAP-OT-2.
	   ACCEPT INT-NET LINE 18 POSITION 60 NO BEEP TAB
	      ON EXCEPTION EXCEP MOVE SW3 TO SW3.
	   IF F02 GO TO CAP-OT-1.
	   MOVE INT-NET TO EDI-NET.
	   DISPLAY EDI-NET LINE 18 POSITION 60.
       CAP-OT-3.
	   PERFORM MEN-CONF.
	   MOVE 28 TO SW3.
	   PERFORM CAP-COD1.
	   IF F02 GO TO CAP-OT-2.
	   IF F01 GO TO CAP-OT-4.
	   MOVE SPACES TO MEN-1 MEN-2 MEN-3.
	   PERFORM MENS-PAN.
	   PERFORM M-NO-GRABA 50 TIMES.
	   MOVE SPACES TO MEN-1 MEN-2 MEN-3.
	   PERFORM MENS-PAN.
	   GO TO CAP-OT-1.
       CAP-OT-4.
	   MOVE INT-IMP TO IMP-ACT IMP-IMP.
	   MOVE INT-ACT TO ACT-ACT ACT-IMP.
	   MOVE MES-IVA TO MM-IMP.
	   MOVE ANO-IVA TO AA-IMP.
	   MOVE DIA-IVA TO DD-IMP.
	   MOVE COM-IVA TO COMPRO-IMP.
	   MOVE NUM-EMP TO EMP-IMP.
	   MOVE SUC-EMP TO SUC-IMP.
	   COMPUTE GAS-TOT = GAS-TOT + INT-NET. 
	   IF GAS-TOT > IMP-SUM
		    COMPUTE GAS-TOT = GAS-TOT - INT-NET 
		    GO TO CAP-OT-2.
	   OPEN I-O IMPU.
	   READ IMPU INVALID KEY MOVE 0 TO NET-IMP.
	   IF COD-OPE = "A"
	      COMPUTE NET-IMP = NET-IMP + INT-NET
	      ELSE COMPUTE NET-IMP = NET-IMP - INT-NET.
	   REWRITE REG-IMPU INVALID KEY WRITE REG-IMPU.
	   CLOSE IMPU.
	   GO TO CAP-OT.
       CAP-OT-F.
	   EXIT.     
       CONS-NUM.
	   OPEN INPUT CUENTAS EMPRESAS ALICUO IVA.
	   MOVE " CONS.,BAJA Y MODIF." TO D20-CAP.
	   PERFORM MEN-MODA-S.
	   PERFORM MODA-PAN.
	   PERFORM BORRA-PANTA.
	   PERFORM PANTA-1 THRU PANTA-11.
	   PERFORM CARGA-EMP THRU CARGA-EMP-F.
	   PERFORM CHEQUEA-CLAVE1.
	   IF COD-CLAVE = 9 PERFORM CIERRE-A GO TO INI-MOD.
       CONS-NUM1.
	   PERFORM BORRA-PANTA-C THRU BORRA-PANTA-C1.
	   PERFORM CARGA-LIB THRU CARGA-FEC.
	   MOVE "AD" TO COD-LEO.
	   MOVE 0 TO MOV-IVA.
	   START IVA KEY IS NOT < CLAVE-IVA
		     INVALID KEY GO TO CONS-NUM1.
       CONS-NUM2.
	   MOVE 0 TO TOT-CAP TOT-CAP1 CRE-DEB-CAP.
	   IF COD-LEO = "AD"
	     READ IVA NEXT AT END GO TO CONS-NUM1.
	   IF COD-LEO = "AT"
	     READ IVA PREVIOUS AT END GO TO CONS-NUM1.
	   IF EMP-IVA NOT = NUM-EMP GO TO CONS-NUM1.
	   IF SUC-IVA NOT = SUC-EMP GO TO CONS-NUM1.
	   IF IVA-IVA NOT = IVA-CAP GO TO CONS-NUM1.
	   PERFORM BORRA-PANTA-C THRU BORRA-PANTA-C1.
	   PERFORM LEO-ALI THRU LEO-ALI-F.
	   PERFORM DESP-LIB THRU DESP-CRE.
	   MOVE "<F1>RES.<F2>AN" TO MEN-1.
	   MOVE "T.<F3>PROX.<F9" TO MEN-2.
	   MOVE ">MOD.<F10>BAJA" TO MEN-3.
	   PERFORM MENS-PAN.
	   MOVE 28 TO SW3.
	   PERFORM CAP-COD1.
	   IF ESCAP PERFORM CIERRE-A GO TO INI-MOD.
	   IF F02 MOVE "AT" TO COD-LEO GO TO CONS-NUM2.
	   IF F03 MOVE "AD" TO COD-LEO GO TO CONS-NUM2.
	   IF F09 GO TO MODI.
	   IF F10 GO TO BAJA.
	   IF F01 GO TO RESO.
	   GO TO CONS-NUM1.
       CONTROL-I-1.
	   IF IMP-1-CAP = IMP-1-INT 
		 COMPUTE CRE-DEB-CAP = CRE-DEB-CAP + IMP-1-INT
		    MOVE CRE-DEB-CAP TO CRE-DEB-IVA
		    GO TO CONTROL-I-1-F.
	   MOVE IMP-1-INT TO IMP-1-EDI.
	   COMPUTE TOT-CAP = TOT-CAP - IMP-1-IVA.
	   PERFORM DESP-TOT.
	   MOVE 29 TO SW3.
	   DISPLAY IMP-1-EDI LINE TAB-LIN(SW3) POSITION TAB-COL(SW3)
		    SIZE TAB-SIZ(SW3) BLINK REVERSE.
	   MOVE "CONFIRME CON <F" TO MEN-1.
	   MOVE "1> IMPORTE CALC" TO MEN-2.
	   MOVE "ULADO          " TO MEN-3.
	   PERFORM MENS-PAN.
	   MOVE 28 TO SW3.
	   PERFORM CAP-COD1.
	   IF ESCAP PERFORM CIERRE-A GO TO INI-MOD.
	   IF F01 MOVE IMP-1-INT TO IMP-1-CAP IMP-1-IVA
		  COMPUTE CRE-DEB-CAP = CRE-DEB-CAP + IMP-1-INT
		  MOVE CRE-DEB-CAP TO CRE-DEB-IVA
		  PERFORM DESP-I-1
		  PERFORM DESP-TOT
		  GO TO CONTROL-I-1-F.
	   IF IVA-IVA NOT = 1
	     IF IMP-1-IVA > IMP-1-INT
		COMPUTE CRE-DEB-CAP = CRE-DEB-CAP + IMP-1-INT
		ELSE COMPUTE CRE-DEB-CAP = CRE-DEB-CAP + IMP-1-IVA.
	   IF IVA-IVA = 1
	     IF IMP-1-IVA > IMP-1-INT
		COMPUTE CRE-DEB-CAP = CRE-DEB-CAP + IMP-1-IVA
		ELSE COMPUTE CRE-DEB-CAP = CRE-DEB-CAP + IMP-1-INT.
	   MOVE CRE-DEB-CAP TO CRE-DEB-IVA.
	   PERFORM DESP-I-1.
	   PERFORM DESP-TOT.
       CONTROL-I-1-F.
	   EXIT.
       CONTROL-I-2.
	   IF IMP-2-CAP = IMP-2-INT 
		 COMPUTE CRE-DEB-CAP = CRE-DEB-CAP + IMP-2-INT
		   MOVE CRE-DEB-CAP TO CRE-DEB-IVA   
		    GO TO CONTROL-I-2-F.
	   MOVE IMP-2-INT TO IMP-2-EDI.
	   COMPUTE TOT-CAP = TOT-CAP - IMP-2-IVA.
	   PERFORM DESP-TOT.
	   MOVE 31 TO SW3.
	   DISPLAY IMP-2-EDI LINE TAB-LIN(SW3) POSITION TAB-COL(SW3)
		    SIZE TAB-SIZ(SW3) BLINK REVERSE.
	   MOVE "CONFIRME CON <F" TO MEN-1.
	   MOVE "1> IMPORTE CALC" TO MEN-2.
	   MOVE "ULADO          " TO MEN-3.
	   PERFORM MENS-PAN.
	   MOVE 28 TO SW3.
	   PERFORM CAP-COD1.
	   IF ESCAP PERFORM CIERRE-A GO TO INI-MOD.
	   IF F01 MOVE IMP-2-INT TO IMP-2-CAP IMP-2-IVA
		  COMPUTE CRE-DEB-CAP = CRE-DEB-CAP + IMP-2-INT
		  MOVE CRE-DEB-CAP TO CRE-DEB-IVA
		  PERFORM DESP-I-2
		  PERFORM DESP-TOT
		  GO TO CONTROL-I-2-F.
	   IF IVA-IVA NOT = 1
	     IF IMP-2-IVA > IMP-2-INT
		COMPUTE CRE-DEB-CAP = CRE-DEB-CAP + IMP-2-INT
		ELSE COMPUTE CRE-DEB-CAP = CRE-DEB-CAP + IMP-2-IVA.
	   IF IVA-IVA = 1
	     IF IMP-2-IVA > IMP-2-INT
		COMPUTE CRE-DEB-CAP = CRE-DEB-CAP + IMP-2-IVA
		ELSE COMPUTE CRE-DEB-CAP = CRE-DEB-CAP + IMP-2-INT.
	   IF NETO-CAP = 0
	     IF IMP-2-IVA NOT = 0
		MOVE IMP-2-IVA TO CRE-DEB-CAP.
	   MOVE CRE-DEB-CAP TO CRE-DEB-IVA.
	   PERFORM DESP-I-2.
	   PERFORM DESP-TOT.
       CONTROL-I-2-F.
	   EXIT. 
       CONTROL-PER.
	   IF PER-CAP = PER-INT 
		    GO TO CONTROL-PER-F.
	   IF PER-CAP = 0 GO TO CONTROL-PER-F.
	   MOVE PER-INT TO PER-EDI.
	   COMPUTE TOT-CAP = TOT-CAP - PER-IVA.
	   PERFORM DESP-TOT.
	   MOVE 33 TO SW3.
	   DISPLAY PER-EDI LINE TAB-LIN(SW3) POSITION TAB-COL(SW3)
		    SIZE TAB-SIZ(SW3) BLINK REVERSE.
	   MOVE "CONFIRME CON <F" TO MEN-1.
	   MOVE "1> IMPORTE CALC" TO MEN-2.
	   MOVE "ULADO          " TO MEN-3.
	   PERFORM MENS-PAN.
	   MOVE 28 TO SW3.
	   PERFORM CAP-COD1.
	   IF ESCAP PERFORM CIERRE-A GO TO INI-MOD.
	   IF F01 MOVE PER-INT TO PER-CAP PER-IVA
		  PERFORM DESP-PER
		  PERFORM DESP-TOT
		  GO TO CONTROL-PER-F.
	   PERFORM DESP-PER.
	   PERFORM DESP-TOT.
       CONTROL-PER-F.
	   EXIT.           
       CARGA-EMP.
	   PERFORM MEN-MODA-S.
	   MOVE 6 TO SW3.
	   PERFORM BORRA.
	   MOVE 5 TO SW3.
	   PERFORM BORRA.
	   MOVE 4 TO SW3.
	   PERFORM BORRA.
	   PERFORM CAP-NUM.
	   IF ESCAP PERFORM CIERRE-A GO TO INI-MOD.
	   IF NUM-CAP = 0 GO TO CARGA-EMP.
	   MOVE NUM-CAP TO NUM-EMP EMP-CTA.
	   MOVE 0 TO SUC-EMP.
	   READ EMPRESAS INVALID KEY GO TO CARGA-EMP.
	   MOVE 6 TO SW3.
	   PERFORM BORRA.
	   DISPLAY RAZ-SOC-EMP LINE TAB-LIN(SW3) POSITION TAB-COL(SW3)
			      SIZE TAB-SIZ(SW3).
       CARGA-SUC.
	   PERFORM MEN-ANTE.
	   MOVE 5 TO SW3.
	   PERFORM BORRA.
	   PERFORM CAP-NUM.
	   IF ESCAP PERFORM CIERRE-A GO TO INI-MOD.
	   IF F02 GO TO CARGA-EMP.
	   MOVE NUM-CAP TO SUC-EMP.
	   READ EMPRESAS INVALID KEY GO TO CARGA-SUC.       
	   MOVE 6 TO SW3.
	   PERFORM BORRA.
	   DISPLAY RAZ-SOC-EMP LINE TAB-LIN(SW3) POSITION TAB-COL(SW3)
			       SIZE TAB-SIZ(SW3).
	   PERFORM CHEQUEA-CLAVE1.
	   IF COD-CLAVE = 9 PERFORM CIERRE-A GO TO INI-MOD.
	   MOVE NUM-EMP TO EMP-IVA.
	   MOVE SUC-EMP TO SUC-IVA.
       CARGA-EMP-F.
	   EXIT.
       CARGA-LIB.
	   PERFORM MEN-ANTE-DES.
	   MOVE 8 TO SW3.
	   PERFORM BORRA.
	   MOVE 7 TO SW3.
	   PERFORM BORRA.
	   PERFORM CAP-NUM.
	   IF ESCAP PERFORM CIERRE-A GO TO INI-MOD.
	   IF F02 PERFORM CIERRE-A GO TO INI-MOD.
	   IF F03 MOVE IVA-CAP TO NUM-CAP.
	   MOVE NUM-CAP TO IVA-CAP IVA-IVA.
	   PERFORM DESP-LIB.
       CARGA-FEC.
	   MOVE 9 TO SW3.
	   PERFORM BORRA.
	   ACCEPT FEC-CAP LINE TAB-LIN(SW3) POSITION TAB-COL(SW3)
		    SIZE 6 NO BEEP TAB CONVERT
		    ON EXCEPTION EXCEP MOVE SW3 TO SW3.
	   IF ESCAP PERFORM CIERRE-A GO TO INI-MOD.
	   IF F02 GO TO CARGA-LIB.
	   IF F03 MOVE FEC-INT TO FEC-CAP.
	   MOVE FEC-CAP TO FEC-INT.
	   MOVE DIA-CAP TO DIA-IVA.
	   MOVE MES-CAP TO MES-IVA.
	   MOVE ANO-CAP TO ANO-IVA.
	   PERFORM DESP-FEC.
       CARGA-ALI.
	   MOVE 10 TO SW3.
	   PERFORM BORRA.
	   PERFORM CAP-NUM.
	   IF ESCAP PERFORM CIERRE-A GO TO INI-MOD.
	   IF F02 GO TO CARGA-FEC.
	   IF F03 MOVE ALI-CAP TO NUM-CAP.
	   MOVE NUM-CAP TO ALI-CAP ALI-IVA ALI-ALI.
	   MOVE NUM-EMP TO EMP-ALI.
	   MOVE SUC-EMP TO SUC-ALI.
	   PERFORM DESP-ALI.
       CARGA-RUB.
	   PERFORM MEN-ANTE-DES.
	   MOVE 11 TO SW3.
	   PERFORM BORRA.
	   PERFORM CAP-NUM.
	   IF ESCAP PERFORM CIERRE-A GO TO INI-MOD.
	   IF F02 GO TO CARGA-FEC.
	   IF F03 MOVE RUBRO-CAP TO NUM-CAP.
	   MOVE NUM-CAP TO RUBRO-CAP RUBRO-IVA.
	   PERFORM DESP-RUB.
       CARGA-CUE.
	   MOVE 12 TO SW3.
	   PERFORM BORRA.
	   PERFORM CAP-NUM.
	   IF ESCAP PERFORM CIERRE-A GO TO INI-MOD.
	   IF F02 GO TO CARGA-RUB.
	   IF F03 MOVE CUE-CAP TO NUM-CAP.
	   MOVE NUM-CAP TO CUENTA CUE-CAP CUE-IVA.
	   MOVE 0 TO SUB-CUENTA.
	   MOVE NUM-EMP TO EMP-CTA.
	   MOVE SUC-EMP TO SUC-CTA.
	   MOVE RUBRO-IVA TO RUBRO-CTA.
	   IF CUENTA NOT = 0 
	       MOVE NOMBRE-C TO DESCR-IVA DESCR-CAP
	       MOVE IGAN TO CUIT-IVA CUIT-CAP
	       MOVE INSCRIPTO TO INS-CAP INS-IVA.
	   PERFORM DESP-CUE.
       CARGA-DES.
	   PERFORM MEN-ANTE-DES.
	   MOVE 13 TO SW3.
	   PERFORM BORRA.
	   PERFORM CAP-ALF.
	   IF ESCAP PERFORM CIERRE-A GO TO INI-MOD.
	   IF F02 GO TO TAREA1-2.
	   IF F03 MOVE DESCR-CAP TO ALF-CAP.
	   MOVE ALF-CAP TO DESCR-CAP DESCR-IVA NOMBRE-C.
	   PERFORM DESP-DES.
       CARGA-INS.
	   MOVE "<R> RESP.INSC. " TO MEN-1.
	   MOVE "<N> R.NO INSC. " TO MEN-2.
	   MOVE "<C> CONS.FINAL " TO MEN-3.
	   MOVE "<E> EXTO/NO INS" TO MEN-4.
           MOVE "<M> MONOT. <X> " TO MEN-5
	   PERFORM MENS-PAN.
	   MOVE 15 TO SW3.
	   PERFORM BORRA.
	   MOVE 14 TO SW3.
	   PERFORM BORRA.
	   PERFORM CAP-ALF.
	   PERFORM MEN-MODA-S.
	   PERFORM MEN-ANTE-DES.
	   IF ESCAP PERFORM CIERRE-A GO TO INI-MOD.
	   IF F02 GO TO CARGA-DES.
	   IF F03 MOVE INS-CAP TO ALF-CAP.
	   MOVE ALF-CAP TO INS-CAP INS-IVA INSCRIPTO.
	   PERFORM DESP-INS.
       CARGA-CUIT.
	   MOVE 16 TO SW3.
	   PERFORM BORRA.
	   PERFORM CAP-ALF.
	   IF ESCAP PERFORM CIERRE-A GO TO INI-MOD.
	   IF F02 GO TO CARGA-INS.
	   IF F03 MOVE CUIT-CAP TO ALF-CAP.
	   IF INS-IVA = "C" OR INS-IVA = "c"
	     IF ALF-CAP NOT = SPACES GO TO CARGA-CUIT.
	   MOVE ALF-CAP TO CUIT-CAP CUIT-IVA IGAN.
	   PERFORM DESP-CUIT.
       CARGA-T-C.
	   PERFORM MEN-ANTE-DES.
	   MOVE 18 TO SW3.
	   PERFORM BORRA.
	   MOVE 17 TO SW3.
	   PERFORM BORRA.
	   IF COD-OPE = "M" MOVE TIP-COM-IVA TO TIP-COM-CAP.
	   PERFORM CAP-NUM.
	   IF ESCAP PERFORM CIERRE-A GO TO INI-MOD.
	   IF F02 GO TO TAREA1-2.
	   IF F03 MOVE TIP-COM-CAP TO NUM-CAP.
	   MOVE NUM-CAP TO TIP-COM-CAP TIP-COM-IVA.
	   PERFORM DESP-T-C.
       CARGA-S-T-C.
	   MOVE 19 TO SW3.
	   PERFORM BORRA.
	   IF COD-OPE = "M" MOVE SUB-T-C-IVA TO SUB-T-C-CAP.
	   PERFORM CAP-ALF.
	   IF ESCAP PERFORM CIERRE-A GO TO INI-MOD.
	   IF F02 GO TO CARGA-T-C.
	   IF F03 MOVE SUB-T-C-CAP TO ALF-CAP.
	   IF ALF-CAP NOT = "A"
	      IF ALF-CAP NOT = "B"
		  IF ALF-CAP NOT = "C" 
		    IF ALF-CAP NOT = " " GO TO CARGA-S-T-C.
	   IF IVA-IVA = 1
	    IF TIP-IVA-EMP = "R"
	      IF INS-IVA = "C" OR INS-IVA = "c" OR INS-IVA = "M"
                 OR INS-IVA = "m" OR INS-IVA = "E" OR INS-IVA = "e" 
		 IF ALF-CAP NOT = "B" MOVE "B" TO SUB-T-C-INT
		       PERFORM CONF-SUB THRU CONF-SUB-F.
	   IF IVA-IVA = 1
	    IF TIP-IVA-EMP = "R"
	      IF INS-IVA = "E" OR INS-IVA = "e"
		 IF ALF-CAP NOT = "B" MOVE "B" TO SUB-T-C-INT
		       PERFORM CONF-SUB THRU CONF-SUB-F.
	   IF IVA-IVA = 1
	     IF TIP-IVA-EMP = "R" 
	      IF INS-IVA = "R" OR INS-IVA = "r"
		 IF ALF-CAP NOT = "A" MOVE "A" TO SUB-T-C-INT
		       PERFORM CONF-SUB THRU CONF-SUB-F.
	   IF IVA-IVA = 1
	    IF TIP-IVA-EMP = "R"
	      IF INS-IVA = "N" OR INS-IVA = "n"
		 IF ALF-CAP NOT = "A" MOVE "A" TO SUB-T-C-INT
		       PERFORM CONF-SUB THRU CONF-SUB-F.
	   IF IVA-IVA = 1
	    IF TIP-IVA-EMP NOT = "R" 
	       IF ALF-CAP NOT = "C" MOVE "C" TO SUB-T-C-INT
		       PERFORM CONF-SUB THRU CONF-SUB-F.
	   IF IVA-IVA = 2 OR IVA-IVA = 3
	      IF INS-IVA = "E" OR INS-IVA = "e" OR INS-IVA = "M"
                 OR INS-IVA = "m"
		 IF ALF-CAP NOT = "C" MOVE "C" TO SUB-T-C-INT
		       PERFORM CONF-SUB THRU CONF-SUB-F.
	   IF IVA-IVA = 2 OR IVA-IVA = 3
	      IF INS-IVA = "N" OR INS-IVA = "n"
		 IF ALF-CAP NOT = "C" MOVE "C" TO SUB-T-C-INT
		       PERFORM CONF-SUB THRU CONF-SUB-F.
	   IF IVA-IVA = 2 OR IVA-IVA = 3
	     IF TIP-IVA-EMP = "R" 
	       IF INS-IVA = "R" OR INS-IVA = "r"
		 IF ALF-CAP NOT = "A" MOVE "A" TO SUB-T-C-INT
		       PERFORM CONF-SUB THRU CONF-SUB-F.
	   IF IVA-IVA = 2 OR IVA-IVA = 3
	     IF TIP-IVA-EMP = "N"
	       IF INS-IVA = "R" OR INS-IVA = "r"
		  IF ALF-CAP NOT = "A" MOVE "A" TO SUB-T-C-INT
		       PERFORM CONF-SUB THRU CONF-SUB-F.
	   IF IVA-IVA = 2 OR IVA-IVA = 3
	     IF TIP-IVA-EMP = "E" 
	       IF INS-IVA = "R" OR INS-IVA = "r"
		 IF ALF-CAP NOT = "B" MOVE "B" TO SUB-T-C-INT
		       PERFORM CONF-SUB THRU CONF-SUB-F. 
	   MOVE ALF-CAP TO SUB-T-C-CAP SUB-T-C-IVA.
	   PERFORM DESP-S-T-C.
       CARGA-S-C.
	   MOVE 20 TO SW3.
	   PERFORM BORRA.
	   IF COD-OPE = "M" MOVE SUC-C-IVA TO SUC-C-CAP.
	   PERFORM CAP-NUM.
	   IF ESCAP PERFORM CIERRE-A GO TO INI-MOD.
	   IF F02 GO TO CARGA-S-T-C.
	   IF F03 MOVE SUC-C-CAP TO NUM-CAP.
	   MOVE NUM-CAP TO SUC-C-CAP SUC-C-IVA.
	   PERFORM DESP-S-C.
       CARGA-COM.
	   MOVE 21 TO SW3.
	   PERFORM BORRA.
	   IF COD-OPE = "M" MOVE COM-IVA TO COM-CAP.
	   PERFORM CAP-NUM.
	   IF ESCAP PERFORM CIERRE-A GO TO INI-MOD.
	   IF F01 COMPUTE COM-CAP = COM-CAP + 1
		  MOVE COM-CAP TO NUM-CAP.
	   IF F02 GO TO CARGA-S-C.
	   IF F03 MOVE COM-CAP TO NUM-CAP.
	   MOVE NUM-CAP TO COM-CAP COM-IVA.
	   PERFORM DESP-COM.
       CARGA-F-V.
	   MOVE 22 TO SW3.
	   PERFORM BORRA.
	   IF COD-OPE = "M" MOVE DIA-VAL-IVA TO DIA-VAL-CAP
			    MOVE MES-VAL-IVA TO MES-VAL-CAP
			    MOVE ANO-VAL-IVA TO ANO-VAL-CAP
			    MOVE FEC-VAL-CAP TO FEC-VAL-INT.
	   ACCEPT FEC-VAL-CAP LINE TAB-LIN(SW3) POSITION TAB-COL(SW3)
		    SIZE 6 NO BEEP TAB CONVERT
		    ON EXCEPTION EXCEP MOVE SW3 TO SW3.
	   IF ESCAP PERFORM CIERRE-A GO TO INI-MOD.
	   IF F01 MOVE FEC-INT TO FEC-VAL-CAP.
	   IF F02 GO TO CARGA-COM.
	   IF F03 MOVE FEC-VAL-INT TO FEC-VAL-CAP.
	   MOVE FEC-VAL-CAP TO FEC-VAL-INT.
	   MOVE DIA-VAL-CAP TO DIA-VAL-IVA.
	   MOVE MES-VAL-CAP TO MES-VAL-IVA.
	   MOVE ANO-VAL-CAP TO ANO-VAL-IVA.
	   PERFORM DESP-F-V.
       CARGA-NET.
	   MOVE SPACES TO MEN-1 MEN-2 MEN-3.
	   PERFORM MENS-PAN.
	   MOVE 23 TO SW3.
	   PERFORM BORRA.
	   MOVE 0 TO NETO-CAP.
	   ACCEPT NETO-CAP LINE TAB-LIN(SW3) POSITION TAB-COL(SW3)
		    SIZE TAB-SIZ(SW3) NO BEEP TAB CONVERT
		    ON EXCEPTION EXCEP MOVE SW3 TO SW3.
	   IF ESCAP PERFORM CIERRE-A GO TO INI-MOD.
	   IF F03 MOVE NETO-IVA TO NETO-CAP.
	   MOVE NETO-CAP TO NETO-IVA.
	   PERFORM DESP-NET.
       CARGA-N-GRA.
	   MOVE SPACES TO MEN-1 MEN-2 MEN-3.
	   PERFORM MENS-PAN.
	   MOVE 24 TO SW3.
	   PERFORM BORRA.
	   MOVE 0 TO NO-GRA-CAP.
	   ACCEPT NO-GRA-CAP LINE TAB-LIN(SW3) POSITION TAB-COL(SW3)
		    SIZE TAB-SIZ(SW3) NO BEEP TAB CONVERT
		    ON EXCEPTION EXCEP MOVE SW3 TO SW3.
	   IF ESCAP PERFORM CIERRE-A GO TO INI-MOD.
	   IF F03 MOVE NO-GRA-IVA TO NO-GRA-CAP.
	   MOVE NO-GRA-CAP TO NO-GRA-IVA.
	   PERFORM DESP-N-GRA.
       CARGA-EXE.
	   MOVE SPACES TO MEN-1 MEN-2 MEN-3.
	   PERFORM MENS-PAN.
	   MOVE 25 TO SW3.
	   PERFORM BORRA.
	   MOVE 0 TO EXE-CAP.
	   ACCEPT EXE-CAP LINE TAB-LIN(SW3) POSITION TAB-COL(SW3)
		    SIZE TAB-SIZ(SW3) NO BEEP TAB CONVERT
		    ON EXCEPTION EXCEP MOVE SW3 TO SW3.
	   IF ESCAP PERFORM CIERRE-A GO TO INI-MOD.
	   IF F03 MOVE EXE-IVA TO EXE-CAP.
	   MOVE EXE-CAP TO EXE-IVA.
	   PERFORM DESP-EXE.   
       CARGA-DED.
	   MOVE SPACES TO MEN-1 MEN-2 MEN-3.
	   PERFORM MENS-PAN.
	   MOVE 26 TO SW3.
	   PERFORM BORRA.
	   MOVE 0 TO DED-CAP.
	   ACCEPT DED-CAP LINE TAB-LIN(SW3) POSITION TAB-COL(SW3)
		    SIZE TAB-SIZ(SW3) NO BEEP TAB CONVERT
		    ON EXCEPTION EXCEP MOVE SW3 TO SW3.
	   IF ESCAP PERFORM CIERRE-A GO TO INI-MOD.
	   IF F03 MOVE DED-IVA TO DED-CAP.
	   MOVE DED-CAP TO DED-IVA.
	   PERFORM DESP-DED. 
       CARGA-RET.
	   MOVE SPACES TO MEN-1 MEN-2 MEN-3.
	   PERFORM MENS-PAN.
	   MOVE 27 TO SW3.
	   PERFORM BORRA.
	   MOVE 0 TO RET-CAP.
	   ACCEPT RET-CAP LINE TAB-LIN(SW3) POSITION TAB-COL(SW3)
		    SIZE TAB-SIZ(SW3) NO BEEP TAB CONVERT
		    ON EXCEPTION EXCEP MOVE SW3 TO SW3.
	   IF ESCAP PERFORM CIERRE-A GO TO INI-MOD.
	   IF F03 MOVE RET-IVA TO RET-CAP.
	   MOVE RET-CAP TO RET-IVA.
	   PERFORM DESP-RET.  
       CARGA-I-1.
	   MOVE SPACES TO MEN-1 MEN-2 MEN-3.
	   PERFORM MENS-PAN.
	   MOVE 29 TO SW3.
	   PERFORM BORRA.
	   MOVE 0 TO IMP-1-CAP.
	   ACCEPT IMP-1-CAP LINE TAB-LIN(SW3) POSITION TAB-COL(SW3)
		    SIZE TAB-SIZ(SW3) NO BEEP TAB CONVERT
		    ON EXCEPTION EXCEP MOVE SW3 TO SW3.
	   IF ESCAP PERFORM CIERRE-A GO TO INI-MOD.
	   IF F03 MOVE IMP-1-IVA TO IMP-1-CAP.
	   MOVE IMP-1-CAP TO IMP-1-IVA.
	   PERFORM DESP-I-1.    
       CARGA-I-2.
	   MOVE SPACES TO MEN-1 MEN-2 MEN-3.
	   PERFORM MENS-PAN.
	   MOVE 31 TO SW3.
	   PERFORM BORRA.
	   MOVE 0 TO IMP-2-CAP.
	   ACCEPT IMP-2-CAP LINE TAB-LIN(SW3) POSITION TAB-COL(SW3)
		    SIZE TAB-SIZ(SW3) NO BEEP TAB CONVERT
		    ON EXCEPTION EXCEP MOVE SW3 TO SW3.
	   IF ESCAP PERFORM CIERRE-A GO TO INI-MOD.
	   IF F03 MOVE IMP-2-IVA TO IMP-2-CAP.
	   MOVE IMP-2-CAP TO IMP-2-IVA.
	   PERFORM DESP-I-2.      
       CARGA-PER.
	   MOVE SPACES TO MEN-1 MEN-2 MEN-3.
	   PERFORM MENS-PAN.
	   MOVE 33 TO SW3.
	   PERFORM BORRA.
	   MOVE 0 TO PER-CAP.
	   ACCEPT PER-CAP LINE TAB-LIN(SW3) POSITION TAB-COL(SW3)
		    SIZE TAB-SIZ(SW3) NO BEEP TAB CONVERT
		    ON EXCEPTION EXCEP MOVE SW3 TO SW3.
	   IF ESCAP PERFORM CIERRE-A GO TO INI-MOD.
	   IF F03 MOVE PER-IVA TO PER-CAP.
	   MOVE PER-CAP TO PER-IVA.
	   PERFORM DESP-PER.    
       CARGA-TOT.
	   MOVE SPACES TO MEN-1 MEN-2 MEN-3.
	   PERFORM MENS-PAN.
	   MOVE 35 TO SW3.
	   PERFORM BORRA.
	   MOVE 0 TO TOT-CAP1.
	   ACCEPT TOT-CAP1 LINE TAB-LIN(SW3) POSITION TAB-COL(SW3)
		    SIZE TAB-SIZ(SW3) NO BEEP TAB CONVERT
		    ON EXCEPTION EXCEP MOVE SW3 TO SW3.
	   IF ESCAP PERFORM CIERRE-A GO TO INI-MOD.
	   IF F03 MOVE TOT-INT1 TO TOT-CAP1.
	   MOVE TOT-CAP1 TO TOT-INT1.
       CARGA-BAS.
	   MOVE 0 TO BASE-CAP.
	   MOVE 45 TO SW3.
	   PERFORM BORRA.
	   ACCEPT BASE-CAP LINE TAB-LIN(SW3) POSITION TAB-COL(SW3)
		    SIZE TAB-SIZ(SW3) NO BEEP TAB CONVERT
		    ON EXCEPTION EXCEP MOVE SW3 TO SW3.
	   IF ESCAP PERFORM CIERRE-A GO TO INI-MOD.
	   PERFORM DESP-BAS.
       CARGA-RES.
	   MOVE 0 TO RES-CAP.
	   MOVE 46 TO SW3.
	   PERFORM BORRA.
	   ACCEPT RES-CAP LINE TAB-LIN(SW3) POSITION TAB-COL(SW3)
		     SIZE TAB-SIZ(SW3) NO BEEP TAB CONVERT
		     ON EXCEPTION EXCEP MOVE SW3 TO SW3.
	   IF ESCAP PERFORM CIERRE-A GO TO INI-MOD.
	   PERFORM DESP-RES. 
       CARGA-DOM.
	   MOVE 38 TO SW3.
	   PERFORM BORRA.
	   PERFORM CAP-ALF.
	   IF ESCAP PERFORM CIERRE-A GO TO INI-MOD.
	   IF F02 GO TO TAREA1-2.
	   IF F03 MOVE DIRE TO ALF-CAP.
	   MOVE ALF-CAP TO DIRE.
       CARGA-CP.
	   MOVE 39 TO SW3.
	   PERFORM BORRA.
	   PERFORM CAP-NUM.
	   IF ESCAP PERFORM CIERRE-A GO TO INI-MOD.
	   IF F02 GO TO CARGA-DOM.
	   IF F03 MOVE COD-LOCA TO NUM-CAP.
	   MOVE NUM-CAP TO COD-LOCA.
       CARGA-TEL.
	   MOVE 40 TO SW3.
	   PERFORM BORRA.
	   PERFORM CAP-ALF.
	   IF ESCAP PERFORM CIERRE-A GO TO INI-MOD.
	   IF F02 GO TO CARGA-CP.
	   IF F03 MOVE TEL TO ALF-CAP.
	   MOVE ALF-CAP TO TEL.
       CARGA-IBRU.
	   MOVE 42 TO SW3.
	   PERFORM BORRA.
	   PERFORM CAP-ALF.
	   IF ESCAP PERFORM CIERRE-A GO TO INI-MOD.
	   IF F02 GO TO CARGA-TEL.
	   IF F03 MOVE ING-BRUTOS TO ALF-CAP.
	   MOVE ALF-CAP TO ING-BRUTOS.
       CARGA-C-IBRU.
	   MOVE 44 TO SW3.
	   PERFORM BORRA.
	   MOVE 43 TO SW3.
	   PERFORM BORRA.
	   PERFORM CAP-NUM.
	   IF ESCAP PERFORM CIERRE-A GO TO INI-MOD.
	   IF F02 GO TO CARGA-IBRU.
	   IF F03 MOVE C-ING-BRUTOS TO NUM-CAP.
	   MOVE SPACES TO D-IBRU.
	   IF NUM-CAP < 0 GO TO CARGA-C-IBRU.
	   IF NUM-CAP > 4 AND NUM-CAP < 11 GO TO CARGA-C-IBRU.
	   IF NUM-CAP > 16 GO TO CARGA-C-IBRU.
	   IF IVA-IVA = 1
	      IF NUM-CAP > 4 GO TO CARGA-C-IBRU.
	   IF IVA-IVA NOT = 1
	      IF NUM-CAP < 4  GO TO CARGA-C-IBRU.
	   IF NUM-CAP = 0 MOVE "CONS.FINAL" TO D-IBRU.
	   IF NUM-CAP = 1 MOVE "INSCRIPTO(CL)" TO D-IBRU.
	   IF NUM-CAP = 2 MOVE "NO INSCR.(CL)" TO D-IBRU.
	   IF NUM-CAP = 3 MOVE "EXENTO(CL)" TO D-IBRU.
	   IF NUM-CAP = 4 MOVE "OT.JURISD." TO D-IBRU.
	   IF NUM-CAP = 11 MOVE "MINORISTA(PR)" TO D-IBRU.
	   IF NUM-CAP = 12 MOVE "MAYORISTA(PR)" TO D-IBRU.
	   IF NUM-CAP = 13 MOVE "MANUFAC.(PR)" TO D-IBRU.
	   IF NUM-CAP = 14 MOVE "INDUSTR.(PR)" TO D-IBRU.
	   IF NUM-CAP = 15 MOVE "MANUF.NO OB(PR)" TO D-IBRU.
	   IF NUM-CAP = 16 MOVE "INDUS.NO OB(PR)" TO D-IBRU.
	   MOVE 44 TO SW3.
	   PERFORM BORRA.
	   DISPLAY D-IBRU LINE TAB-LIN(SW3) POSITION TAB-COL(SW3)
		     SIZE TAB-SIZ(SW3) BLINK REVERSE.
	   MOVE NUM-CAP TO C-ING-BRUTOS.
       CARGA-P-C.
	    MOVE 0 TO POR-COM.
	    MOVE 41 TO SW3.
	    PERFORM BORRA.
	    ACCEPT POR-COM LINE TAB-LIN(SW3) POSITION TAB-COL(SW3)
		       SIZE TAB-SIZ(SW3) NO BEEP TAB
		       ON EXCEPTION EXCEP MOVE SW3 TO SW3.
	    IF ESCAP PERFORM CIERRE-A GO TO INI-MOD.
	    IF F02 GO TO TAREA1-1.    
       ACERO.
	   MOVE 0 TO NETO-IVA NO-GRA-IVA EXE-IVA DED-IVA.
	   MOVE 0 TO RET-IVA IMP-1-IVA IMP-2-IVA CRE-DEB-IVA.
	   MOVE 0 TO PER-IVA TOT-CAP CRE-DEB-CAP.
       SUMA-BASE.
	   MOVE 0 TO BASE-CAP.
	   COMPUTE BASE-CAP = NETO-IVA + NO-GRA-IVA + EXE-IVA.
	   IF IVA-IVA = 1
	     IF INSCRIPTO = "N" OR INSCRIPTO = "E" OR INSCRIPTO = "M"
	       COMPUTE BASE-CAP = BASE-CAP + IMP-1-IVA + IMP-2-IVA.
	   IF IVA-IVA > 1
	     IF TIP-IVA-EMP = "N" OR TIP-IVA-EMP = "E" 
               OR TIP-IVA-EMP = "M" 
	       COMPUTE BASE-CAP = BASE-CAP + IMP-1-IVA + IMP-2-IVA.
       CALC-RES.
	   IF IVA-IVA > 1 GO TO CALC-RES-C1.
       CALC-RES-V1.
	   IF C-ING-BRUTOS > 2 MOVE 0 TO BASE-CAP RES-CAP
		      GO TO CALC-RES-V2.
	   COMPUTE RES-CAP ROUNDED = BASE-CAP * ( ALI-PER(C-ING-BRUTOS)
		      / 100 ).
       CALC-RES-V2.
	   DISPLAY P-004.
	   PERFORM DESP-BAS THRU DESP-RES.
	   MOVE "CONFIRMA <F1>  " TO MEN-1.
	   MOVE "MODIFICA PERCEP" TO MEN-2.
	   MOVE "CION <F10>     " TO MEN-3.
	   PERFORM MENS-PAN.
	   MOVE 28 TO SW3.
	   PERFORM CAP-COD1.
	   IF ESCAP PERFORM CIERRE-A GO TO INI-MOD.
	   IF F01 GO TO CALC-RES-F.
	   IF F10 GO TO CALC-RES-V3.
	   GO TO CALC-RES-V2.
       CALC-RES-V3.
	   MOVE 0 TO BASE-CAP.
	   PERFORM CARGA-BAS.
	   PERFORM CARGA-RES.
	   GO TO CALC-RES-V2.
       CALC-RES-C1. 
	   IF C-ING-BRUTOS < 12 OR C-ING-BRUTOS > 14
		      MOVE 0 TO BASE-CAP RES-CAP
		      GO TO CALC-RES-C2.
	   COMPUTE RES-CAP ROUNDED = BASE-CAP * ( ALI-PER(C-ING-BRUTOS)
		      / 100 ).
       CALC-RES-C2.
	   DISPLAY P-004.
	   PERFORM DESP-BAS THRU DESP-RES.
	   MOVE "CONFIRMA <F1>  " TO MEN-1.
	   MOVE "MODIFICA PERCEP" TO MEN-2.
	   MOVE "CION <F10>     " TO MEN-3.
	   PERFORM MENS-PAN.
	   MOVE 28 TO SW3.
	   PERFORM CAP-COD1.
	   IF ESCAP PERFORM CIERRE-A GO TO INI-MOD.
	   IF F01 GO TO CALC-RES-F.
	   IF F10 GO TO CALC-RES-C3.
	   GO TO CALC-RES-C2.
       CALC-RES-C3.
	   MOVE 0 TO BASE-CAP.
	   PERFORM DESP-BAS.
	   PERFORM CARGA-RES.
	   GO TO CALC-RES-C2.
       CALC-RES-F.
	   EXIT.
       NOPUEDE.
	   MOVE "ERROR EN CODIGO" TO MEN-1.
	   MOVE "S DE CUENTA - <" TO MEN-2.
	   MOVE "F1> VUELVE     " TO MEN-3.
	   PERFORM MENS-PAN.
	   MOVE 28 TO SW3.
	   PERFORM CAP-COD1.
	   IF ESCAP PERFORM CIERRE-A GO TO INI-MOD.
	   IF F01 GO TO TAREA1-2.
	   GO TO NOPUEDE.
       CONF-SUB.
	   MOVE 19 TO SW3.
	   DISPLAY SUB-T-C-INT LINE TAB-LIN(SW3) POSITION TAB-COL(SW3)
		      SIZE TAB-SIZ(SW3) BLINK REVERSE.
	   MOVE "CONFIRME CON <F" TO MEN-1.
	   MOVE "1> COMPROBANTE " TO MEN-2.
	   MOVE "SUPUESTO       " TO MEN-3.
	   PERFORM MENS-PAN.
	   MOVE 28 TO SW3.
	   PERFORM CAP-COD1.
	   IF ESCAP PERFORM CIERRE-A GO TO INI-MOD.
	   IF F01 MOVE SUB-T-C-INT TO ALF-CAP
		  GO TO CONF-SUB-F.
       CONF-SUB-F.
	   EXIT.
       DESP-LIB.
	   MOVE 37 TO SW3.
	   PERFORM BORRA.
	   MOVE 8 TO SW3.
	   PERFORM BORRA.
	   MOVE 7 TO SW3.
	   PERFORM BORRA.
	   MOVE IVA-IVA TO IVA-EDI.
	   DISPLAY IVA-EDI LINE TAB-LIN(SW3) POSITION TAB-COL(SW3)
			SIZE TAB-SIZ(SW3).
	   MOVE SPACES TO D-IVA-EDI.
	   IF IVA-IVA = 1 MOVE "- VENTA -" TO D-IVA-EDI
		  MOVE "DEBITO" TO D-CRE-DEB-EDI.
	   IF IVA-IVA = 2 MOVE "- COMPRAS -" TO D-IVA-EDI
		  MOVE "CREDITO" TO D-CRE-DEB-EDI.
	   IF IVA-IVA = 3 MOVE "- GASTOS -" TO D-IVA-EDI
		  MOVE "CREDITO" TO D-CRE-DEB-EDI.
	   MOVE 8 TO SW3.
	   DISPLAY D-IVA-EDI LINE TAB-LIN(SW3) POSITION TAB-COL(SW3)
			SIZE TAB-SIZ(SW3) REVERSE.
	   MOVE 37 TO SW3.
	   DISPLAY D-CRE-DEB-EDI LINE TAB-LIN(SW3) POSITION TAB-COL(SW3)
			SIZE TAB-SIZ(SW3) BLINK.
       DESP-FEC.
	   MOVE 9 TO SW3.
	   PERFORM BORRA.
	   MOVE DIA-IVA TO DIA-EDI.
	   MOVE MES-IVA TO MES-EDI.
	   MOVE ANO-IVA TO ANO-EDI.
	   DISPLAY FEC-EDI LINE TAB-LIN(SW3) POSITION TAB-COL(SW3)
		      SIZE TAB-SIZ(SW3).
       DESP-ALI.
	   MOVE 10 TO SW3.
	   PERFORM BORRA.
	   MOVE ALI-IVA TO ALI-EDI.
	   DISPLAY SPACES LINE 9 POSITION 72 SIZE 5.
	   IF IVA-IVA = 2 OR IVA-IVA = 3
	     IF ALI-IVA > 99 AND ALI-IVA < 110
	      DISPLAY "RETEN" LINE 9 POSITION 72 BLINK REVERSE.
	   IF IVA-IVA = 2 OR IVA-IVA = 3
	     IF ALI-IVA > 49 AND ALI-IVA < 60 
	      DISPLAY "B.USO" LINE 9 POSITION 72 BLINK REVERSE.
	   IF IVA-IVA = 2 OR IVA-IVA = 3
	     IF ALI-IVA > 59 AND ALI-IVA < 70
	      DISPLAY "EXP/I" LINE 9 POSITION 72 BLINK REVERSE.
	   DISPLAY ALI-EDI LINE TAB-LIN(SW3) POSITION TAB-COL(SW3)
		      SIZE TAB-SIZ(SW3).
       DESP-RUB.
	   MOVE 11 TO SW3.
	   PERFORM BORRA.
	   MOVE RUBRO-IVA TO RUBRO-EDI.
	   DISPLAY RUBRO-EDI LINE TAB-LIN(SW3) POSITION TAB-COL(SW3)
		      SIZE TAB-SIZ(SW3).
       DESP-CUE.
	   MOVE 12 TO SW3.
	   PERFORM BORRA.
	   MOVE CUE-IVA TO CUE-EDI.
	   DISPLAY CUE-EDI LINE TAB-LIN(SW3) POSITION TAB-COL(SW3)
		       SIZE TAB-SIZ(SW3).
       DESP-DES.
	   MOVE 13 TO SW3.
	   PERFORM BORRA.
	   MOVE DESCR-IVA TO DESCR-EDI.
	   DISPLAY DESCR-EDI LINE TAB-LIN(SW3) POSITION TAB-COL(SW3)
			SIZE TAB-SIZ(SW3).
       DESP-INS.
	   MOVE 14 TO SW3.
	   PERFORM BORRA.
	   MOVE INS-IVA TO INS-EDI.
	   DISPLAY INS-EDI LINE TAB-LIN(SW3) POSITION TAB-COL(SW3)
		       SIZE TAB-SIZ(SW3).
	   MOVE "**********" TO D-INS-EDI.
	   MOVE 15 TO SW3.
	   PERFORM BORRA.
	   IF INS-IVA = "R" OR INS-IVA = "r" 
		  MOVE "RESP.INSC." TO D-INS-EDI.
	   IF INS-IVA = "N" OR INS-IVA = "n" 
		  MOVE "R.NO INSC." TO D-INS-EDI.
	   IF INS-IVA = "E" OR INS-IVA = "e"
		  MOVE "EXTO/NO RESP" TO D-INS-EDI.
	   IF INS-IVA = "C" OR INS-IVA = "c"
		  MOVE "CONS.FINAL" TO D-INS-EDI.
           IF INS-IVA = "M" OR INS-IVA = "m"
                  MOVE "RESP.MONOT" TO D-INS-EDI.
           IF INS-IVA = "X" OR INS-IVA = "x"
                  MOVE "RESP.NO CAT" TO D-INS-EDI.
	   DISPLAY D-INS-EDI LINE TAB-LIN(SW3) POSITION TAB-COL(SW3)
			SIZE TAB-SIZ(SW3). 
       DESP-CUIT. 
	   MOVE 16 TO SW3.
	   PERFORM BORRA.
	   MOVE CUIT-IVA TO CUIT-EDI.
	   DISPLAY CUIT-EDI LINE TAB-LIN(SW3) POSITION TAB-COL(SW3)
		      SIZE TAB-SIZ(SW3).
       DESP-T-C.
	   MOVE 17 TO SW3.
	   PERFORM BORRA.
	   MOVE TIP-COM-IVA TO TIP-COM-EDI.
	   DISPLAY TIP-COM-EDI LINE TAB-LIN(SW3) POSITION TAB-COL(SW3)
		     SIZE TAB-SIZ(SW3).
	   MOVE SPACES TO D-TIP-COM-EDI.
      **     IF TIP-COM-IVA NOT = 0
      **   ---  13/5/95 OJO     
	   IF TIP-COM-IVA < 1 OR 
	      TIP-COM-IVA > 9 MOVE 2 TO TIP-COM-IVA
			      MOVE ABREV(TIP-COM-IVA) TO D-TIP-COM-EDI.
	   MOVE 18 TO SW3.
	   PERFORM BORRA.
	   DISPLAY D-TIP-COM-EDI LINE TAB-LIN(SW3) POSITION TAB-COL(SW3)
		     SIZE TAB-SIZ(SW3) REVERSE.
       DESP-S-T-C.
	   MOVE 19 TO SW3.
	   PERFORM BORRA.
	   MOVE SUB-T-C-IVA TO SUB-T-C-EDI.
	   DISPLAY SUB-T-C-EDI LINE TAB-LIN(SW3) POSITION TAB-COL(SW3)
		     SIZE TAB-SIZ(SW3) REVERSE.
       DESP-S-C.
	   MOVE 20 TO SW3.
	   PERFORM BORRA.
	   MOVE SUC-C-IVA TO SUC-C-EDI.
	   DISPLAY SUC-C-EDI LINE TAB-LIN(SW3) POSITION TAB-COL(SW3)
		      SIZE TAB-SIZ(SW3) REVERSE.
       DESP-COM.
	   MOVE 21 TO SW3.
	   PERFORM BORRA.
	   MOVE COM-IVA  TO COM-EDI.
	   DISPLAY COM-EDI LINE TAB-LIN(SW3) POSITION TAB-COL(SW3)
			 SIZE TAB-SIZ(SW3) REVERSE.
       DESP-F-V.
	   MOVE 22 TO SW3.
	   PERFORM BORRA.
	   MOVE DIA-VAL-IVA TO DIA-VAL-EDI.
	   MOVE MES-VAL-IVA TO MES-VAL-EDI.
	   MOVE ANO-VAL-IVA TO ANO-VAL-EDI.
	   DISPLAY FEC-VAL-EDI LINE TAB-LIN(SW3) POSITION TAB-COL(SW3)
		      SIZE TAB-SIZ(SW3).
       DESP-NET.
	   MOVE 23 TO SW3.
	   PERFORM BORRA.
	   MOVE NETO-IVA TO NETO-EDI.
	   DISPLAY NETO-EDI LINE TAB-LIN(SW3) POSITION TAB-COL(SW3)
		       SIZE TAB-SIZ(SW3).
	   COMPUTE TOT-CAP = TOT-CAP + NETO-IVA.
	   PERFORM DESP-TOT.
       DESP-N-GRA.
	   MOVE 24 TO SW3.
	   PERFORM BORRA.
	   MOVE NO-GRA-IVA TO NO-GRA-EDI.
	   DISPLAY NO-GRA-EDI LINE TAB-LIN(SW3) POSITION TAB-COL(SW3)
		       SIZE TAB-SIZ(SW3).
	   COMPUTE TOT-CAP = TOT-CAP + NO-GRA-IVA.
	   PERFORM DESP-TOT.
       DESP-EXE.
	   MOVE 25 TO SW3.
	   PERFORM BORRA.
	   MOVE EXE-IVA TO EXE-EDI.
	   DISPLAY EXE-EDI LINE TAB-LIN(SW3) POSITION TAB-COL(SW3)
			       SIZE TAB-SIZ(SW3).
	   COMPUTE TOT-CAP = TOT-CAP + EXE-IVA.
	   PERFORM DESP-TOT.    
       DESP-DED.
	   MOVE 26 TO SW3.
	   PERFORM BORRA.
	   MOVE DED-IVA TO DED-EDI.
	   DISPLAY DED-EDI LINE TAB-LIN(SW3) POSITION TAB-COL(SW3)
		       SIZE TAB-SIZ(SW3).
	   COMPUTE TOT-CAP = TOT-CAP + DED-IVA.
	   PERFORM DESP-TOT.
       DESP-RET.
	   MOVE 27 TO SW3.
	   PERFORM BORRA.
	   MOVE RET-IVA TO RET-EDI.
	   DISPLAY RET-EDI LINE TAB-LIN(SW3) POSITION TAB-COL(SW3)
		       SIZE TAB-SIZ(SW3).
	   COMPUTE TOT-CAP = TOT-CAP + RET-IVA.
	   PERFORM DESP-TOT.
       DESP-I-1.
	   MOVE 29 TO SW3.
	   PERFORM BORRA.
	   MOVE IMP-1-IVA TO IMP-1-EDI.
	   DISPLAY IMP-1-EDI LINE TAB-LIN(SW3) POSITION TAB-COL(SW3)
		       SIZE TAB-SIZ(SW3).
	   COMPUTE TOT-CAP = TOT-CAP + IMP-1-IVA.
	   PERFORM DESP-TOT.    
       DESP-I-2.
	   MOVE 31 TO SW3.
	   PERFORM BORRA.
	   MOVE IMP-2-IVA TO IMP-2-EDI.
	   DISPLAY IMP-2-EDI LINE TAB-LIN(SW3) POSITION TAB-COL(SW3)
		       SIZE TAB-SIZ(SW3).
	   COMPUTE TOT-CAP = TOT-CAP + IMP-2-IVA.
	   PERFORM DESP-TOT.  
       DESP-PER.
	   MOVE 33 TO SW3.
	   PERFORM BORRA.
	   MOVE PER-IVA TO PER-EDI.
	   DISPLAY PER-EDI LINE TAB-LIN(SW3) POSITION TAB-COL(SW3)
		       SIZE TAB-SIZ(SW3).
	   COMPUTE TOT-CAP = TOT-CAP + PER-IVA.
	   PERFORM DESP-TOT.   
       DESP-CRE.
	   MOVE 37 TO SW3.
	   PERFORM BORRA.
	   DISPLAY D-CRE-DEB-EDI LINE TAB-LIN(SW3) POSITION TAB-COL(SW3)
		   SIZE TAB-SIZ(SW3).
	   MOVE 36 TO SW3.
	   PERFORM BORRA.
	   MOVE CRE-DEB-IVA TO CRE-DEB-EDI.
	   DISPLAY CRE-DEB-EDI LINE TAB-LIN(SW3) POSITION TAB-COL(SW3)
		       SIZE TAB-SIZ(SW3) BLINK REVERSE.
       DESP-TOT.
	   MOVE 35 TO SW3.
	   PERFORM BORRA.
	   MOVE TOT-CAP TO TOT-EDI.
	   DISPLAY TOT-EDI LINE TAB-LIN(SW3) POSITION TAB-COL(SW3)
		       SIZE TAB-SIZ(SW3).
       DESP-BAS.
	   MOVE 45 TO SW3.
	   PERFORM BORRA.
	   MOVE BASE-CAP TO BASE-EDI.
	   DISPLAY BASE-EDI LINE TAB-LIN(SW3) POSITION TAB-COL(SW3)
			    SIZE TAB-SIZ(SW3).
       DESP-RES.
	   MOVE 46 TO SW3.
	   PERFORM BORRA.
	   MOVE RES-CAP TO RES-EDI.
	   DISPLAY RES-EDI LINE TAB-LIN(SW3) POSITION TAB-COL(SW3)
			   SIZE TAB-SIZ(SW3).
       LEO-ACT.
	   READ ACTI INVALID KEY MOVE 0 TO POR-ACT.
       LEO-ALI.
	   MOVE NUM-EMP TO EMP-ALI.
	   MOVE SUC-EMP TO SUC-ALI.
	   MOVE ALI-IVA TO ALI-ALI.
	   MOVE 0 TO AA-ALI MM-ALI DD-ALI.
	   MOVE 0 TO IVA-1-INT IVA-2-INT IVA-3-INT.
	   START ALICUO KEY IS NOT < CLAVE-ALICUO
		   INVALID KEY GO TO LEO-ALI-F.
       LEO-ALI1.
	   READ ALICUO NEXT AT END GO TO LEO-ALI2.
	   IF EMP-ALI > NUM-EMP GO TO LEO-ALI2.
	   IF EMP-ALI < NUM-EMP GO TO LEO-ALI1.
	   IF EMP-ALI = NUM-EMP
	     IF SUC-ALI > SUC-EMP GO TO LEO-ALI2.
	   IF ALI-ALI NOT = ALI-IVA GO TO LEO-ALI1.
           MOVE ANO-VAL-IVA TO ANO1.
           IF ANO1 < 99 ADD 2000 TO ANO1
              ELSE ADD 1900 TO ANO1.
	   IF AA-ALI > ANO1 GO TO LEO-ALI2.
	   IF AA-ALI = ANO1
	       IF MM-ALI > MES-VAL-IVA GO TO LEO-ALI2.
	   IF AA-ALI = ANO1
	       IF MM-ALI = MES-VAL-IVA
		  IF DD-ALI > DIA-VAL-IVA GO TO LEO-ALI2.
	   MOVE IVA-1-ALI TO IVA-1-INT.
	   MOVE IVA-2-ALI TO IVA-2-INT.
	   MOVE IVA-3-ALI TO IVA-3-INT.
	   GO TO LEO-ALI1.
       LEO-ALI2.
	   MOVE IVA-1-INT TO IVA-1-ALI IVA-1-EDI.
	   MOVE IVA-2-INT TO IVA-2-ALI IVA-2-EDI.
	   MOVE IVA-3-INT TO IVA-3-ALI IVA-3-EDI.
	   MOVE 30 TO SW3.
	   DISPLAY IVA-1-EDI LINE TAB-LIN(SW3) POSITION TAB-COL(SW3)
		       SIZE TAB-SIZ(SW3).
	   MOVE 32 TO SW3.
	   DISPLAY IVA-2-EDI LINE TAB-LIN(SW3) POSITION TAB-COL(SW3)
		       SIZE TAB-SIZ(SW3).
	   MOVE 34 TO SW3.
	   DISPLAY IVA-3-EDI LINE TAB-LIN(SW3) POSITION TAB-COL(SW3)
		       SIZE TAB-SIZ(SW3).
       LEO-ALI-F.
	   EXIT.
       MEN-NO-CTA.
	   MOVE "-- RUBRO NO HAB" TO MEN-1.
	   MOVE "ILITADO PARA CU" TO MEN-2.
	   MOVE "ENTAS CTES. -- " TO MEN-3.
	   PERFORM MENS-PAN.
       M-NO-GRABA.
	   MOVE "*** NO GRABA **" TO MEN-1.
	   MOVE "*              " TO MEN-2.
	   MOVE "               " TO MEN-3.
	   PERFORM MENS-PAN.    
       PANTA-1.
	   DISPLAY "EMPRESA  :          SUC:      - " LINE 7 POSITION 5.
	   DISPLAY "LIBRO    : " LINE 9 POSITION 5.
	   DISPLAY "FECHA :" LINE 9 POSITION 40.
	   DISPLAY "ALIC. :" LINE 9 POSITION 60.
	   DISPLAY "RUBRO    :          " LINE 11 POSITION 5.
	   DISPLAY "CUENTA :          - DESC.: " LINE 11 POSITION 25.
       PANTA-11.
	   DISPLAY "INSCRIPTO: " LINE 12 POSITION 5.
	   DISPLAY "CUIT : " LINE 12 POSITION 45.
	   DISPLAY "TIPO COMP: " LINE 13 POSITION 5.
	   DISPLAY "NRO :" LINE 13 POSITION 25.
	   DISPLAY "FEC.VAL.:" LINE 13 POSITION 45.
	   DISPLAY "NETO     :" LINE 15 POSITION 5.
	   DISPLAY "NO GRAV. :" LINE 16 POSITION 5.
	   DISPLAY "EXTO/NO I:" LINE 17 POSITION 5.
	   DISPLAY "DED/INCR.:" LINE 18 POSITION 5.
	   DISPLAY "RETENC.  :" LINE 19 POSITION 5.
	   DISPLAY "IVA    % :" LINE 20 POSITION 5.
	   DISPLAY "IVA    % :" LINE 21 POSITION 5.
	   DISPLAY "PER    % :" LINE 22 POSITION 5.
	   DISPLAY "TOTAL    :" LINE 23 POSITION 5.
	   DISPLAY P-001.
       PANTA-2.
	   DISPLAY "DOMICILIO: " LINE 12 POSITION 5 REVERSE.
	   DISPLAY SPACES LINE 12 POSITION 16 SIZE 46.
	   DISPLAY "C. POSTAL: " LINE 13 POSITION 5 REVERSE.
	   DISPLAY "TEL.:" LINE 13 POSITION 25 REVERSE.
	   DISPLAY SPACES LINE 13 POSITION 31 SIZE 30.
	   DISPLAY SPACES LINE 14 POSITION 5 SIZE 61.
	   DISPLAY "ING.BRUTOS: " LINE 14 POSITION 5 REVERSE.
	   DISPLAY "SITUACION : " LINE 14 POSITION 35 REVERSE.
       PANTA-3.
	   DISPLAY P-003.
       PANTA-4.
	   DISPLAY "IMP/TASA :              " LINE 15 POSITION 50
		   REVERSE.
	   DISPLAY "ACTIVIDAD:              " LINE 16 POSITION 50
		   REVERSE.
	   DISPLAY "                        " LINE 17 POSITION 50
		   REVERSE.
	   DISPLAY "IMPORTE  :              " LINE 18 POSITION 50
		   REVERSE.
       PANTA-5.
	   DISPLAY "                        " LINE 18 POSITION 50.
	   DISPLAY "                        " LINE 17 POSITION 50.
	   DISPLAY "                        " LINE 16 POSITION 50.
	   DISPLAY "                        " LINE 15 POSITION 50.           
       CONF-CAMPOS.
	   MOVE 045125 TO TAB-POS(1).
	   MOVE 250275 TO TAB-POS(2).
	   MOVE 102004 TO TAB-POS(3).
	   MOVE 254101 TO TAB-POS(28).
	   MOVE 071604 TO TAB-POS(4).
	   MOVE 073002 TO TAB-POS(5).
	   MOVE 073730 TO TAB-POS(6).
	   MOVE 091601 TO TAB-POS(7).
	   MOVE 092010 TO TAB-POS(8).
	   MOVE 094808 TO TAB-POS(9).
	   MOVE 096803 TO TAB-POS(10).
	   MOVE 111607 TO TAB-POS(11).
	   MOVE 113406 TO TAB-POS(12).
	   MOVE 115225 TO TAB-POS(13).
	   MOVE 121601 TO TAB-POS(14).
	   MOVE 122015 TO TAB-POS(15).
	   MOVE 125215 TO TAB-POS(16).
	   MOVE 131601 TO TAB-POS(17).
	   MOVE 132004 TO TAB-POS(18).
	   MOVE 133101 TO TAB-POS(19).
	   MOVE 133204 TO TAB-POS(20).
	   MOVE 133608 TO TAB-POS(21).
	   MOVE 135508 TO TAB-POS(22).
	   MOVE 151617 TO TAB-POS(23).
	   MOVE 161617 TO TAB-POS(24).
	   MOVE 171617 TO TAB-POS(25).
	   MOVE 181617 TO TAB-POS(26).
	   MOVE 191617 TO TAB-POS(27).
	   MOVE 201617 TO TAB-POS(29).
	   MOVE 200902 TO TAB-POS(30).
	   MOVE 211617 TO TAB-POS(31).
	   MOVE 210902 TO TAB-POS(32).
	   MOVE 221617 TO TAB-POS(33).
	   MOVE 220902 TO TAB-POS(34).
	   MOVE 231617 TO TAB-POS(35).
	   MOVE 225417 TO TAB-POS(36).
	   MOVE 215407 TO TAB-POS(37).
	   MOVE 121730 TO TAB-POS(38).
	   MOVE 131704 TO TAB-POS(39).
	   MOVE 133120 TO TAB-POS(40).
	   MOVE 176406 TO TAB-POS(41).
	   MOVE 141715 TO TAB-POS(42).
	   MOVE 144703 TO TAB-POS(43).
	   MOVE 145115 TO TAB-POS(44).
	   MOVE 165814 TO TAB-POS(45).
	   MOVE 175814 TO TAB-POS(46).
       TIT-PAN.
	   MOVE "   - ARCHI" TO TIT-1-PAN.
	   MOVE "VO  DE  I." TO TIT-2-PAN.
	   MOVE "V.A. -    " TO TIT-3-PAN.
       OPC-MODA.
	   DISPLAY "<F1>  ALTA DATOS " LINE 14 POSITION 18.
	   DISPLAY "<F3>  CONS., BAJA Y MODIF." LINE 15 POSITION 18.
	   DISPLAY "<ESC> VUELVE AL MENU" LINE 16 POSITION 18.
       BORRA-PANTA.
	   MOVE 0 TO SW1.
	   PERFORM BORRA-P1 VARYING SW1 FROM 6 BY 1 
		     UNTIL SW1 > 23.
       BORRA-P1.
	   DISPLAY SPACES LINE SW1 POSITION 2 SIZE 76.
       BORRA-PANTA-C.
	   MOVE 7 TO SW3.
	   PERFORM BORRA.
	   MOVE 8 TO SW3.
	   PERFORM BORRA.
	   MOVE 9 TO SW3.
	   PERFORM BORRA.
	   MOVE 10 TO SW3.
	   PERFORM BORRA.
       BORRA-PANTA-C1.
	   MOVE 11 TO SW3.
	   PERFORM BORRA.
	   MOVE 12 TO SW3.
	   PERFORM BORRA.
	   MOVE 13 TO SW3.
	   PERFORM BORRA.
       BORRA-PANTA-C11.
	   DISPLAY SPACES LINE 12 POSITION 5 SIZE 70.
	   DISPLAY SPACES LINE 13 POSITION 5 SIZE 70.
	   DISPLAY SPACES LINE 14 POSITION 5 SIZE 70.
	   MOVE 14 TO SW3.
	   PERFORM BORRA.
	   MOVE 15 TO SW3.
	   PERFORM BORRA.
	   MOVE 16 TO SW3.
	   PERFORM BORRA.
	   MOVE 17 TO SW3.
	   PERFORM BORRA.
	   MOVE 18 TO SW3.
	   PERFORM BORRA.
	   MOVE 19 TO SW3.
	   PERFORM BORRA.
	   MOVE 20 TO SW3.
	   PERFORM BORRA.
	   MOVE 21 TO SW3.
	   PERFORM BORRA.
	   MOVE 22 TO SW3.
	   PERFORM BORRA.
	   MOVE 23 TO SW3.
	   PERFORM BORRA.
	   MOVE 24 TO SW3.
	   PERFORM BORRA.
	   MOVE 25 TO SW3.
	   PERFORM BORRA.
	   MOVE 26 TO SW3.
	   PERFORM BORRA.
	   MOVE 27 TO SW3.
	   PERFORM BORRA.
	   MOVE 29 TO SW3.
	   PERFORM BORRA.
	   MOVE 30 TO SW3.
	   PERFORM BORRA.
	   MOVE 31 TO SW3.
	   PERFORM BORRA.
	   MOVE 32 TO SW3.
	   PERFORM BORRA.
	   MOVE 33 TO SW3.
	   PERFORM BORRA.
	   MOVE 34 TO SW3.
	   PERFORM BORRA.
	   MOVE 35 TO SW3.
	   PERFORM BORRA.
	   MOVE 36 TO SW3.
	   PERFORM BORRA.
	   MOVE 42 TO SW3.
	   PERFORM BORRA.
	   MOVE 43 TO SW3.
	   PERFORM BORRA.
	   MOVE 44 TO SW3.
	   PERFORM BORRA.
       BORRA-PANTA-C2.
	   MOVE 38 TO SW3.
	   PERFORM BORRA.
	   MOVE 39 TO SW3.
	   PERFORM BORRA.
	   MOVE 40 TO SW3.
	   PERFORM BORRA.
       BORRA-PAN3.
	   DISPLAY SPACES LINE 15 POSITION 50 SIZE 25.
	   DISPLAY SPACES LINE 16 POSITION 50 SIZE 25.
	   DISPLAY SPACES LINE 17 POSITION 50 SIZE 25.
	   DISPLAY SPACES LINE 18 POSITION 50 SIZE 25.
       CIERRE-A.
	   CLOSE CUENTAS EMPRESAS IVA ALICUO.
       COPY "PANTA.PRO".
       COPY "BORRA.PRO".
       COPY "MENSA.PRO".
       COPY "CAPTU.PRO".
       COPY "DESPLI.PRO".
       COPY "CLAVES.PRO".