       IDENTIFICATION DIVISION.
       PROGRAM-ID. CAPIVA.
       AUTHOR. GUIFFREY ALVARO.
       DATE-WRITTEN. ENE'92.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. PC-XT-AT.
       OBJECT-COMPUTER. PC-XT-AT.
      * SPECIAL-NAMES.
      *       DECIMAL-POINT IS COMMA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
	    COPY "IVA.SEL".
       DATA DIVISION.
       FILE SECTION.
	    COPY "IVA.REG".

       WORKING-STORAGE SECTION.
       01  ERRORES      PIC XX.
       01 H             PIC 99999 VALUE 0.

       PROCEDURE DIVISION.
       ABRO.
	    OPEN I-O IVA.
	    MOVE 0 TO H.
       LEA.
	    READ IVA NEXT AT END CLOSE IVA
				STOP RUN.
	    IF SUC-C-IVA = 5
	       MOVE 3 TO SUC-C-IVA.
	    REWRITE REG-IVA INVALID KEY DISPLAY "IMP"
		  GO TO LEA.
	    DISPLAY "REGRABE".
	    COMPUTE H = H + 1.
	    DISPLAY H.
	    GO TO LEA.

